{
    "nov-21-2017": {
        "title": "Brapi.org Updates",
        "date": "November 21, 2017",
        "author": "Peter Selby",
        "article": "<p>Brapi.org has been updated!</p> <p>The original site was developed in an afternoon during the 2017 Seattle hackathon. It was an excelent start and gave the BrAPI community a public face and brand. But it was not very developer friendly. As a single page site, every addition quickly accumulated to a monolithic structure. It was becoming a hassle to update and was starting to become difficult for users to find relevent information.</p> <h4>Whats new?</h4> <p>The majority of the changes you can see in the server side file structure. Feel free to take a look at the <a href=\"https://github.com/plantbreeding/brapi-website\">BrAPI site GitHub</a> for more details. Generally speaking, the single giant html file has changed into a handful of smaller PHP files, which are much easier to develop and manage. Also, the whole project has been Dockerized, which makes server management and deployments of future updates much easier.</p><p>From a users perspective, there has been some reorganization to try to promote usability. The single home page has been broken into a small set of logical pages. The \"About\" and \"Use Cases\" sections have been lumped together and are still presented on the home page. The \"Links\" section has become \"Developer Resources\" and now lives on its own page. The \"Partners\" and \"Acknowledgements\" sections have been lumped together and now have their own page as well. And finally two new pages have been added: \"News\" and \"Events\". \"News\" is intended to be a general purpose, public place to post about BrAPI, the community, and related areas (for example, this post you are reading). \"Events\" is for BrAPI related event notices, primarily Hackathons right now, but could grow in the future.</p> <p>Brapi.org is great place for more outside groups to discover and learn about the BrAPI community. It can also be a great communication tool within the community. If you see any issues with the site, please raise it on GitHub or <a href=\"mailto:brapicoordinatorselby@gmail.com\">reach out to one of the BrAPI Coordinators</a></p>"
    }
}