{
    "apr-20-2018": {
        "title": "BrAPI Monthly Update - April 2018",
        "date": "April 20, 2018",
        "author": "Peter Selby",
        "article": "<p>I'm happy to formally announce that the next BrAPI Hackathon will be in Texcoco, Mexico, September 10-14, 2018! Keep watch on <a href=\"https://brapi.org/events.php\">Brapi.org</a> for more details, or check the <a href=\"https://forum.brapi.org/t/brapi-hacakthon-texcoco-fall-2018/51/2\">Community Forum</a> and share your excitement. A signup form will be coming soon! </p><p>I'm really excited about the upcoming hackathon. We are prepared for a larger turnout this time, so hopefully we won't have to turn anyone away. Still, the earlier you can sign up, the better, because seats tend to go fast. We received a lot of feedback from Versailles that some kind of introduction to BrAPI for new-comers would be helpful. In response, I have already set aside two and a half hours on day one for this purpose. If you know any individuals or groups who would benefit from BrAPI, encourage them to sign up for this hackathon.</p><p>In other news, BrAPI V1.2 is scheduled to be released next week (April 27th). This release will contain 24 issue fixes, from old clean up items, to newer things discussed in Versailles. This release has been the topic of lots of discussion in the past 6 months, not because of its contents, but because of its timing. This is the test of a 3 month release cycle, and I will be eager to here feedback from the community around this. If no one in the community has the time or resources to implement V1.2, then I will happily drop the 3 month release cycle in favor of a 6 month release cycle. Let me know your thoughts around this, either by email or the <a href=\"https://forum.brapi.org/\">Community Forum.</a></p><p>In parallel with the work on V1.2, a lot of work has been put into a BrAPI Swagger definition. The intent is to change the specification from the \"Blueprint\" markdown format to the \"OpenAPI\" YAML format (aka \"Swagger\"). The OpenAPI format has a strict structure and is a little harder for humans to read, but it will enable lots of cool automated tasks. This includes documentation presentation in a number of different platforms and automatic code generation in 20+ coding languages. Look for that update on GItHub in the next few weeks.</p><p>Finally, we are working on an official BrAPI Publication. Jan Erik, Lukas and I have been working on a draft of this paper and it is almost ready for community input. BrAPI is a community project and we must have the contribution of that community in this publication, so please don't be shy! Even if you have no explicit text to add, leave a comment letting us know that you read it and approve. I'll be sending out details on how to access the draft in the next few weeks.</p>"
    },
    "mar-20-2018": {
        "title": "BrAPI Monthly Update - March 2018",
        "date": "March 20, 2018",
        "author": "Peter Selby",
        "article": "<p>We have a Wiki! I've added a MediaWiki module to brapi.org. This is the original Wiki service, the same technology Wikipedia is built on. My hope is that it can replace the Documentation Github repository as the source for all BrAPI related documentation. All the old documents from Github have already been transferred to the new site, and a few new things have already been added.  As much as I love writing documentation, wiki's work best as a community effort, so please don't be shy about editing or adding content. Everyone should be able to sign in using their Github accounts, so please feel free to contribute.</p><p style=\"margin-left: 20px;\"><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://wiki.brapi.org\">BrAPI Wiki</a></p><p>Along with a new Wiki, I have received several requests for a general discussion forum. In response, I am working on adding a Discourse forum to brapi.org. This will be a place for the community to hold discussions, support each others development efforts, and plan upcoming hackathons together (without needing a million emails). Look for this to go live in the next few weeks at <a href=\"https://forum.brapi.org\">https://forum.brapi.org</a><p>In other news, the EiB Annual Planning meeting concluded a couple weeks ago in Nairobi, Kenya. There were many productive discussions across all 5 EiB modules. The Module #5 group had good representation of many of the major technologies used by the CGIAR, including BrAPI. We focused on what an ideal IT architecture for a breeding program should look like so we could determine what tools and services are missing, and where the important integration points are between tools. The development teams present agreed on 2 critical BrAPI related integration use cases for 2018: Phenotype field data collection, and Genotype sample data collection.</p><p>Also, at the EiB meeting, we were able to discuss scheduling of upcoming events in 2018, which includes the next BrAPI Hackathon. Based on that discussion, we are targeting September for the next hackathon, though exact dates and venue are still undecided. I will let everyone know as soon as I know more.</p>"
    },
    "feb-14-2018": {
        "title": "Versailles BrAPI Hackathon Debrief",
        "date": "February 14, 2018",
        "author": "Peter Selby",
        "article": "<h3>Greetings from Versailles,</h3><p>Last Friday concluded another successful BrAPI Hackathon. I wanted to take a moment to record some of the highlights of the event and open the discussion to those who were not able to attend. </p><p>First, a very very big “THANK YOU” to Cyril Pommier and everyone at INRA who helped make this event possible. Organizing an event like this takes months of planning and coordination. Cyril was instrumental in getting the venue setup and ready for as many people as we could hold. And then, for those not following the weather reports in Versailles, we were welcomed by a surprise snow storm on Tuesday, which made transportation difficult for everyone. The INRA staff valiantly fought through the snow and we were still able to eat and access our equipment. </p><h3 style=\"margin-top: 50px;\">Discussions Highlights</h3><p>Here are a few discussion highlights and big plans made during the hackathon. Nothing here is set in stone, and it is tough to convey several hours of discussion in a couple of sentences. Please reach out to me with any questions or concerns you have with any of these topics.</p><h4>JSON-LD/PUIDs</h4><p style=\"margin-left: 20px;\">There is a new tentative plan around JSON-LD and entity Permanent Unique IDs. It was established that there are 2 problems which need solving. First, is the problem of “sameness”: being able to determine if two entities from two different systems refer to the same thing. Second, is the problem of “origin” or “authority”: what created a particular entity and who has the authority to enforce the data is correct for that entity. <br/> The solution plan has 3 phases, which will be included in future BrAPI versions. First, add a PUID field to each BrAPI entity to check for “sameness”. Second, an “origin” object will be added to each BrAPI entity with enough information to lead a user back to the origin of that object. These two new fields should be enough to solve the problems stated, but from here it is a short leap to implement JSON-LD. So the final phase is some implementation of JSON-LD, which will allow for a whole host of new functionality. </p><h4>Authentication</h4><p style=\"margin-left: 20px;\">Authentication is a feared subject for many in the BrAPI community and it is a complex problem which will hang around for a long time. During the discussion at the hackathon, we started with the basics of how OAuth2 works, the different options available and then moved into how do we create a general solution in the context of BrAPI. It was generally agreed that it is not within the API’s power to enforce any sort of authentication scheme, but the best we could do was establish a clear set of Best Practices. That list is under development and should be available with BrAPI V1.2.</p><h4>New Calls</h4><p style=\"margin-left: 20px;\">There were several discussions around new BrAPI calls which were needed for a variety of use cases. These included User Created Lists, Seed/Planting Material Tracking, and Germplasm Advanced Search. Each of these discussion outlined a new set of objects and issues were created in the BrAPI GitHub to track their addition to the spec. </p><h3 style=\"margin-top: 50px;\">Project Highlights </h3><p>There was a lot of work accomplished during this hackathon and too many projects to list everything here. Below is an overview of the projects which have the greatest impact on the whole BrAPI community.</p><h4>BrAPI R</h4><p style=\"margin-left: 20px;\">A small team worked on cleaning up the BrAPI R library and moved it all to a new home under the CIP Github organization. Links to the new repository have been update on brapi.org. The team also started two new R packages: BrAPI X and BrAPI UI. BrAPI X provides eXtra tools for convenient bulk download breeding data and also do quick summaries and quality checks. BrAPI UI integrates with RStudio to provide interactive visualization tools which work with the BrAPI R library. </p><p style=\"margin-left: 20px;\"><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://github.com/CIP-RIU/brapi\">BrAPI R</a><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://github.com/c5sire/brapix\">BrAPI X</a><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://github.com/c5sire/brapiui\">BrAPI UI</a></p><h4>BrAPI.js</h4><p style=\"margin-left: 20px;\">BrAPI.js is a JavaScript client library for BrAPI. It provides a simple, fluid interface for making BrAPI calls and functionality for chaining groups of calls together and returning a larger complete dataset. Though some of the more complex data manipulation tools are still in development, the core BrAPI interface is ready and can shorten the development time for anyone implementing a BrAPI client in JavaScript. </p><p style=\"margin-left: 20px;\"><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://github.com/solgenomics/BrAPI.js\">BrAPI.js</a></p><h4>Testing Resources</h4><p style=\"margin-left: 20px;\">BrAVA (the BrAPI Validator App) has been updated. It now runs a full suite of validation tests against any BrAPI compliant server, checking for the correct JSON schema. It also runs these tests regularly against any server endpoint located in the brapi-resources.xml. This provides a nice checkup for all the existing public BrAPI servers. Now is a great time for everyone to make sure their published server endpoints and ‘calls’ call are up to date.<br/>The BrAPI official test server is now live. This is a Java Spring server backed by a generic Postgres database based only on BrAPI objects.</p><p style=\"margin-left: 20px;\"><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"http://webapps.ipk-gatersleben.de/brapivalidator/\">BrAVA</a><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://test-server.brapi.org/brapi/v1/\">Test Server</a></p><h4>BrAPP implementations</h4><p style=\"margin-left: 20px;\">Several teams used the Hackathon as an opportunity to add some BrAPPs to their existing applications. This is very exciting and very cool to see this type of tool sharing across the community. There was also a lot of great feedback going back to the BrAPP creators for bug fixes and possible enhancements. Watch for more BrAPPs coming this year.</p><p style=\"margin-left: 20px;\"><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://test.brapi.org/brapps.php\">BrAPPs</a></p><h4>Integration Implementations</h4><p style=\"margin-left: 20px;\">A substantial amount of time was dedicated to implementing some prototypes for broad system integration. The primary focus was on a pedigree verification use case established in December. The group was able to connect data in GOBii to data in BMS or B4R and produce an object which Flapjack was able to read and turn into a visualization. There is still a lot of work need before something like this is production ready, but this was a great first step to realizing this kind of cross system integration with BrAPI.</p>"
    },
    "jan-26-2018": {
        "title": "BrAPI V1.1 Release",
        "date": "January 26, 2018",
        "author": "Peter Selby",
        "article": "<p>BrAPI v1.1 is officially here!</p> <p>Release Highlights</p> <ul> <li>15 issues resolved</li> <li>All IDs are standardized with the form \"xxDbId\"</li> <li>ISO 8601 Date/Time format standardized</li> <li>Studies can now be searched by TrialDbId</li> <li>New calls added for samples and sample tracking to an external vendor</li> </ul> <p>Go <a href=\"https://github.com/plantbreeding/API/files/1668289/BrAPI_V1-1_Release_Notes.xlsx\">HERE</a> for the full change list.</p> <p>The raw markdown can be found on GitHub under the <a href=\"https://github.com/plantbreeding/API/tree/V1.1\">\"V1.1\" tag</a> </p> <p>The human readable formatted API definition can be found on <a href=\"https://brapi.docs.apiary.io/#reference\">Apiary</a> </p> <p>Check  the versions table on the <a href=\"https://github.com/plantbreeding/API/blob/master/README.md\">GitHub README</a> for links to all versions of BrAPI, past, present and future.</p>"
    },
    "jan-12-2018": {
        "title": "Introducing BrAPPs",
        "date": "January 12, 2018",
        "author": "Peter Selby",
        "article": "<p>We are happy to officially introduce BrAPPs to the BrAPI ecosystem. <br/> Go to <a href=\"https://brapi.org/brapps.php\">brapi.org/brapps.php</a> to check out the BrAPP Showcase, and keep checking back because we will be adding more BrAPPs as they become available. </p> <p> What is a BrAPP? <br/> A BrAPP is a BrAPI Application. <br/>  Each BrAPP is a stand alone tool, widget, or plugin built by a member of the BrAPI community. Each BrAPP, as the name implies, should be entirely BrAPI driven. This means a BrAPP can easily be shared with the whole BrAPI community and can be easily added to any system which has a BrAPI implementation.  </p> <p> The goal is to keep the BrAPI community informed about what tools are available and encourage sharing of useful functionality. </p> <p> If you have a tool or widget you feel can become a BrAPP, please reach out to a <a href=\"mailto:brapicoordinatorselby@gmail.com\">BrAPI Coordinator</a>. At a minimum you'll need a public link to the source code, a name and a description. You should also think about a documentation link and a demo page of some kind, so people can see your BrAPP in action.</p>"
    },
    "jan-2-2018": {
        "title": "BrAPI at PAG",
        "date": "January 2, 2018",
        "author": "Peter Selby",
        "article": "<p>BrAPI is going to PAG!</p> <p>Ascot Hall in the Town and Country Convention Center</p> <p>12:00 to 14:00 on Sunday, January 14</p> <p>This will be an informal BrAPI community meetup during the Plant and Animal Genome (PAG) convention. Come meet, socialize, and network with other members in the BrAPI community.</p> <p>I will be using the time to collect feedback from the BrAPI community. What projects should we focus on for the February hackathon and beyond? How do we make BrAPI useful and used by everyone? What does a perfect BrAPI future look like?</p> <p>Can't make it on Sunday? Don't worry, BrAPI representatives will be wandering around the convention center all week. Reach out to me to arrange a meet up.</p> <p>See you all there</p> <p>Peter</p>"
    },
    "nov-30-2017": {
        "title": "Last Chance for Versailles",
        "date": "November 30, 2017",
        "author": "Peter Selby",
        "article": "<p>We only have a few seats left for the Versailles BrAPI Hackathon! </p> <p>Don't miss your chance to join us for a week of hacking, discussions and fun! </p> <p> Come enjoy beautiful Versailles, France on February 5th through 9th! </p> <p> <a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://docs.google.com/forms/d/e/1FAIpQLScMT2PIr3PO0_oDf8akYWO9DRfIi8GbSaovNAIHtaNuw7A8RA/viewform?c=0&w=1\">Sign Up Here!</a> </p> <p>Already signed up? Watch for more details coming soon on <a href=\"https://brapi.org/events.php\">brapi.org</a> </p> <p>Hope to see you there!!</p>"
    },
    "nov-21-2017": {
        "title": "Brapi.org Updates",
        "date": "November 21, 2017",
        "author": "Peter Selby",
        "article": "<p>Brapi.org has been updated!</p> <p>The original site was developed in an afternoon during the 2017 Seattle hackathon. It was an excellent start, and gave the BrAPI community a public face and brand. But it was not very developer friendly. As a single page site, every addition quickly created a monolithic structure. It was becoming a hassle to update and was starting to become difficult for users to find relevant information.</p> <h4>Whats new?</h4> <p>The majority of the changes can be seen in the server side file structure. Feel free to take a look at the <a href=\"https://github.com/plantbreeding/brapi-website\">BrAPI site GitHub</a> for more details. Generally speaking, the single giant html file has changed into a handful of smaller PHP files, which are much easier to develop and manage. Also,the whole project has been Dockerized, which makes server management and deployments of future updates much easier.</p> <p>From a user perspective, there has been some reorganization to promote usability. The single home page has been broken into a small set of logical pages. The \"About\" and \"Use Cases\" sections have been lumped together and are still on the home page. The \"Links\" section has become \"Developer Resources\" and now lives on its own page. The \"Partners\" and \"Acknowledgements\" sections have been lumped together and now have their own page as well. And finally,two new pages have been added: \"News\" and \"Events\". \"News\" is intended to be a general purpose, public place to post about BrAPI, the community, and related content (for example, this post you are reading). \"Events\" is for BrAPI related event notices, primarily Hackathons right now, but could grow in the future.</p> <p>Brapi.org is a great place for outside groups to discover and learn about the BrAPI community. If you see any issues with the site, please raise it on GitHub or <a href=\"mailto:brapicoordinatorselby@gmail.com\">reach out to one of the BrAPI Coordinators</a> </p>"
    }
}