{
    "candidates": [{
        "name": "Guy Davenport, PhD",
        "title": "Breeding Information Consultant",
        "org": "Daveneti Limited (currently contracted to BASF Seeds)",
        "country": "New Zealand",
        "motivation": "I have been working in the field of Plant Breeding Informatics for 25 years, for public and private, international and national breeding programs for annual seed and perennial clonal crops. I have been involved with the BrAPI project for the last 4 years when I was working at Plant and Food Research, and more recently I am working with my client on implementing and extending BrAPI in their organization. I have been involved in Plant Breeding data standards development starting with the International Crop Information System at CIMMYT, then later the early stages of Crop Ontology under the Generation Challenge Programme of CGIAR. I believe I can contribute to BrAPI project by providing advice based on my extensive experience in Plant Breeding Informatics. <br> BrAPI was conceived as a REST API to allow the interoperability of data and tools in the Breeding community. In the future I would like BrAPI to move to developing a true domain model, which although has reference implementations such as REST and GraphQL, could be implemented in any framework. I would like BrAPI to become the de facto standard for Breeding terms and establish a glossary / ontology in collaboration with breeding organizations and other ontology efforts, that is used worldwide. ",
        "experience": [{
            "title": "General Breeding Workflow",
            "text": "I have extensive knowledge in the breeding workflows for annual seed and perennial clonal crops, having worked alongside plant breeders at the John Innes Centre, CIMMYT, Bayer CropScience and Plant and Food Research. "
        }, {
            "title": "Phenotyping and Phenomics",
            "text": "I was involved in the early days of the development of an ontology for phenotyping at CIMMYT. More recently I have helped in the field at CIMMYT and orchard at Plant and Food Research making phenotyping observations. "
        }, {
            "title": "Genotyping and Genomics",
            "text": "I have carried out scientific research as part of my PhD in Plant Molecular Virology. Since then I have been involved in the construction of database systems for Genotyping and Genomics."
        }, {
            "title": "Computer Programming",
            "text": "I have over 25 years’ experience in Java Programming in the field of scientific computing, having co-developed the CoreHunter software and breeding information systems at CIMMYT, Bayer Crop Science and Plant and Food Research. "
        }, {
            "title": "New and Emerging Breeding Technologies",
            "text": "I have a good understand of emerging breeding technologies such as Genomic selection. "
        }, {
            "title": "Germplasm and Accession Management",
            "text": "During my time at John Innes and CIMMYT in was involved in data curation activities in their Genebanks. "
        }, {
            "title": "Data Management",
            "text": "I have worked in Data Management projects most of my life, taking the following roles: Database and Java services developer, Bioinformatics Specialist, Project and Programme Leader, Business Analyst"
        }]
    }, {
        "name": "Dr. Stephan Weise",
        "title": "Head of Genebank Documentation; EURISCO coordinator (European Search Catalogue for Plant Genetic Resources)",
        "org": "Leibniz Institute of Plant Genetics and Crop Plant Research (IPK)",
        "country": "Germany",
        "motivation": "I have been following the development of the BrAPI community for several years. As coordinator of the EURISCO network (European Search Catalogue for Plant Genetic Resources), I am responsible for supporting the exchange of data on plant genetic resources from collections in 43 member countries and making this information accessible to various user groups. In this context, the use of standardized APIs is becoming increasingly important. Against this background and further motivated by discussions in our institute, I would like to get involved in the BrAPI community. On the one hand, to make BrAPI generally better known in the field of plant genebanks. On the other hand, to give suggestions for the BrAPI specification in order to increase the usability of BrAPI for this field.",
        "experience": [{
            "title": "Phenotyping and Phenomics",
            "text": "As a computer scientist, I have no experience with phenotyping itself, but I do have experience with the management and analysis of phenotypic data. I have been responsible for the management of phenotypic data in various research projects and am currently working within the EURISCO network on the harmonization of phenotypic traits with the aim of making them comparable. In this regard, I have also been involved in the MIAPPE consortium."
        }, {
            "title": "Germplasm and Accession Management",
            "text": "As head of Genebank Documentation, I am responsible for the IT-side support of the collection management of the German national ex situ genebank for cultivated plants as well as for the management of the associated data on germplasm accessions. To this end, my working group has been operating an information system for a number of years to manage a wide range of data from different domains and to support the daily work processes of the genebank. In addition, there are aspects of data curation and the regular exchange of data with other information systems."
        }, {
            "title": "Computer Programming",
            "text": "As a trained database and application developer, I have been involved in designing information systems for storing, searching and analyzing data on crop plants for more than 20 years. This also includes the development and provision of REST services for data exchange."
        }, {
            "title": "Data Management",
            "text": "Structured data management is essential for the documentation of plant genetic resources in genebanks. Through my role as head of Genebank Documentation, I have the relevant experience in this area. In addition, as coordinator, I am responsible for the smooth operation and further development of the EURISCO information system. This system manages data on more than two million germplasm accessions provided by over 400 data providers from all over Europe."
        }]
    }, {
        "name": "Valentin GUIGNON",
        "title": "Bioinformatics specialist",
        "org": "The Alliance Bioversity - CIAT",
        "country": "France",
        "motivation": "As an active member of the BrAPI initiative since its inception, I have been deeply involved in the technical discussions for API call architecture and the strategic planning of its functionalities. My active participation spans a series of global BrAPI hackathons (Seattle, PAG, Ithaca, Versailles, Wageningen, virtual events) and including the one co-organized in Montpellier event, which shows my commitment to the collaborative development of this API. <br> I have implemented BrAPI as a generic Drupal (CMS) module. The module offers both BrAPI service provider and consumer. I am currently working on a larger project, BrAPIMapper, that would provide a full up to date BrAPI implementation in a container to be used by any existing system. It is engineered to integrate with diverse data —ranging from relational databases to flat-file structures and external web services— via a configuration-driven approach complemented by a graphical interface for data mapping and BrAPI service management, without need for typing code. <br> As I am working for the banana genetic resources in the framework of the CGIAR GeneBank at the Alliance of Bioversity and CIAT, BrAPI is a good way to expose our genetic resources to breeding and other type of applications. It adds value to our banana genebank accessible through MGIS (Musa Germplasm Information System, Montpellier, France). On one side, we serve our BrAPI content but on the other side, we are also BrAPI service consumers. We explored uses cases with Breeding data by dynamically gather related information from the MusaBase BrAPI service (Cornell University). <br> I’ve also co-developed the BrAPI Trait Selector BrApp with the collaboration of Mirella Gonzalez (BTI, Ithaca, USA), who was hosted in our team for a BrAPI sabbatical. <br> All those things illustrates my extensive experience with its framework but also my readiness to contribute substantively to its advisory board committee. I certainly can provide relevant points of view on questions that could be raised to guide decisions the right way. Moreover, being in Montpellier and working for the CGIAR can add cultural diversity to the BrAPI Advisory Board.",
        "experience": [{
            "title": "Phenotyping and Phenomics",
            "text": "MGIS provides germplasm characterization data, so I have mapped that data to BrAPI phenotyping calls and co-developed the BrAPI Trait Selectors BrApp that deals with this type of data. While the phenotyping data available per-germplasm is not heavy in MGIS (from genebank perspective), it is a different story for breeding databases such as MusaBase, which brings another problematic to that project related to the number of results."
        }, {
            "title": "Germplasm and Accession Management",
            "text": "That’s my main area of expertise. I am the main developer of the MGIS website that is the portal to the ITC genebank and other collections around the world. We have been managing banana germplasm for decades. We keep trying to find ways to add value to our genebank data and provide useful user interfaces to dig and curate them. One important contribution we brought to BrAPI germplasm call is the use of the MCPD ontology."
        }, {
            "title": "Genotyping and Genomics",
            "text": "For genotyping, we have integrated the Gigwa application in our system, which provides a BrAPI endpoint and have a close collaboration with its development team. I also contribute to the development South Green crop community portal for genomics data, so called South Green Genome Hubs"
        }, {
            "title": "Computer Programming",
            "text": "Being both a back-end and front-end developer, I develop in several languages; I’m currently mostly using PHP, Python, Perl and Javascript but I used to code in Java and C++. I’m plaining to include SparQL in BrAPIMapper."
        }, {
            "title": "Data Management",
            "text": "As a database manager, I deal with some types of data management but most of the data management and curation process is led by other colleagues I closely work with. I’m working with several types of databases but mainly PostgreSQL and MySQL; I’ve also used ElasticSearch, MongoDB and tried a couple of others. <br> I'm an active user and contributor to the Chado database schema, which is part of the larger GMOD project — a suite of open-source tools for managing genomic and biological data. My contributions are mainly through the issue tracking and discussion forums on GitHub."
        }, {
            "title": "Additional Relevant Experience",
            "text": "I’m an “ontology consumer” and closely work with ontology experts like the crop ontology. <br> I am a member of the Tripal community, which develops a Drupal module for managing various types of biological data, such as gene sequences, plant germplasm, and the data from phenotypic and genotypic studies. My role has been pivotal in bridging the gap between Tripal and BrAPI communities (e.g. Tripal BrAPI sessions for years at PAG) and I serves there as Tripal Advisory Committee member."
        }]
    }]
}