{
    "aug-03-2023": {
        "ISO8601": "2023-08-03",
        "title": "BrAPI Update - August 2023",
        "date": "August 3, 2023",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\">BrAPI Sabbaticals </h4>   <p class=\"news-post-paragraph\">The next round of BrAPI Sabbatical project proposals is now open, and the deadline has been extended! This is an opportunity for you to travel, learn, build, and collaborate with your peers around the world. Any project is acceptable, as long as it is BrAPI related, but there are only two spots available each year. Go to <a target=\"_blank\" href=\"https://brapi.org/sabbaticals\">brapi.org/sabbaticals </a>for more information, form templates, and examples of last year's successful projects. Please submit your sabbatical project proposal ideas to the <a target=\"_blank\" href=\"mailto:brapicoordinatorselby@gmail.com\">BrAPI Project coordinator </a>by <strong>Friday, September 15!</strong> </p>           <p class=\"news-post-paragraph\">I am here to help if you need it! If you are interested in going on a sabbatical but you need anything, please <a target=\"_blank\" href=\"mailto:brapicoordinatorselby@gmail.com\">contact me </a>. I can help you find a team, a project idea, more time, technical resources, technical guidance, or more. I am committed to making sure that we as a community take full advantage of this opportunity to collaborate and build great things.  </p>          <img src=\"/images/news/road_1.jpg\" class=\"news-post-img\">      <h4 class=\"news-post-header\">BrAPI Virtual Hackathon</h4>   <p class=\"news-post-paragraph\">The next <strong>BrAPI Virtual Hackathon will be October 23-27, 2023</strong>. Join the BrAPI community for a week of fun as we hack code together and discuss the future of BrAPI. Everyone in the BrAPI community is welcome! Save the date and get more information at <a target=\"_blank\" href=\"https://brapi.org/events/hackathon\">brapi.org/events/hackathon </a>. The official registration form for the hackathon will become available soon.  </p>           <p class=\"news-post-paragraph\">The BrAPI Community Hackathon is an event focused on bringing together the BrAPI community. This weeklong event will reserve time for the members of the community to discuss the BrAPI specification, collaborate on projects, socialize and learn from each other. The hackathon is largely self-organizing project work time, with a few scheduled public discussion sessions addressing important community topics. The overall goal is to be as productive as possible in a small window of time, to explore ideas and start on collaborative projects that can be more formally developed after the event. </p>           <p class=\"news-post-paragraph\">One major take away from the past virtual hackathons was that attendees were feeling distracted by other work. If you can, try to reserve the whole week in your schedule so normal work does not intrude on the project work time. Of course, deadlines and emergencies happen, and BrAPI will not always be the top priority. This is just a reminder that you will get more out of the virtual hackathon experience if you can dedicate the time to focus on it. </p>           <p class=\"news-post-paragraph\">You just found the newsletter easter egg. Thank you for reading the community update so thoroughly. Please send me the code phrase \"pickled pawpaws\" to receive community recognition.  </p>           <img src=\"/images/news/meeting_1.jpg\" class=\"news-post-img\">      <h4 class=\"news-post-header\">BrAPI Hackathon Host Volunteer Needed</h4>       <p class=\"news-post-paragraph\">We are looking for a volunteer to host the next in-person BrAPI hackathon sometime in the spring (Q2) of 2024. Specifically, we are looking for an organization in the African/European time zones to host, UTC+0 – UTC+4. We make an effort to rotate the in-person hackathon host around the world each year. This allows the community to share the load of travel time and time zone changes, and it allows everyone to explore and interact with different countries and organizations.  </p>           <p class=\"news-post-paragraph\">If you and your organization are interested in hosting the next BrAPI hackathon, please <a target=\"_blank\" href=\"mailto:brapicoordinatorselby@gmail.com\">contact me </a>. Take a look at the <a target=\"_blank\" href=\"https://docs.google.com/document/d/15Y3byyhVq3xtNqKEe1MbENW8--AEZEmVRVVlOflVcek/edit\">Hackathon Checklist </a>to get an idea of what might be expected of a host.  </p>           <img src=\"/images/news/small_globe_1.jpg\" class=\"news-post-img\">      <h4 class=\"news-post-header\">Request for comments</h4>           <p class=\"news-post-paragraph\">Please review the following issues on GitHub. If the issue has an impact on your work, please consider leaving a comment on the issue. This could be a clarifying question, some constructive criticism, or simply a \"thumbs-up\" emoji to show you approve of the proposed change. Any feedback from the community helps to prioritize issues for future releases of the BrAPI Spec.</p>           <p class=\"news-post-links\">       <a target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/issues/559\">#559 - aliceboizet - Add \"externalURL\" field to externalReference model</a> <br>   <a target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/issues/575\">#575 – abatac - Support for observationUnitLevelName for GET /variables API </a>    <br>   <a target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/issues/573\">#573 – daveneti - Update Sample to allow sub-sampling and bulked samples</a>    <br>   </p>"
    },
    "may-31-2023": {
        "ISO8601": "2023-05-31",
        "title": "Community Announcement – BrAPI Sabbaticals",
        "date": "May 31, 2023",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\"> Sabbatical Projects Live Demos </h4>   <p class=\"news-post-paragraph\">The 2022-2023 BrAPI Sabbatical Program has come to an end. Now it is time for the teams to show off what they were able to build in their time away.</p>   <p class=\"news-post-paragraph\">We will have a public demo session on <strong>Tuesday, June 20, at <a target\"_blan\" href\"https://www.google.com/search?q=13%3A00+UT\">13:00 UTC </a></strong>. We encourage everyone to attend if you can, or watch the recording after the session. These are some interesting projects which can be useful for the BrAPI community, and can hopefully provide inspiration for the next round of project proposals. Please <a target=\"_blank\" href=\"https://docs.google.com/forms/d/e/1FAIpQLSfoSN1l582ycf8CvThLTjZfPb_TnIMs3497bW6gdXmS8hcvYg/viewform?usp=sf_link\">register here </a>to receive the Zoom meeting information. </p>   <p class=\"news-post-paragraph\">Mirella Flores Gonzalez from Breedbase/BTI went to Montpellier, France to work with Valentin Guignon at Bioversity International/CIAT, for 6 weeks. The team at Bioversity have a visual trait selector tool that they wanted to make BrAPI compatible and turn it into a stand-alone BrAPP to be integrated with Breedbase. The tool provides a visual and highly intuitive, point-and-click interface for users to select traits, without the need to dig through an ontology. <a target=\"_blank\" href=\"https://drive.google.com/file/d/18oDAEzKKHiV8i-Lh_7vt_xO0EEWq9a0p/view?usp=drive_link\">Final Report </a></p>   <p class=\"news-post-paragraph\">Moses Nderitu from SEQART Africa went to Canberra, Australia to work with Andrew Kowalczyk at DArT for 5 and a half weeks. DArT has an existing tool called DArTView which is becoming increasingly popular with breeders in Africa for doing downstream analytical processes with marker and genotype data. Moses wanted to make this tool BrAPI compatible and enhance the automated workflow for genotyping and analyzing the data. He also wanted to become an expert in the tool and bring that expertise back to his breeder community. <a target=\"_blank\" href=\"https://drive.google.com/file/d/1OhGH_UmenpbnY9KH3rtErsT7v0YAdhAL/view?usp=drive_link\">Final Report </a></p>   <p class=\"news-post-links\"><a target=\"_blank\" href=\"https://docs.google.com/forms/d/e/1FAIpQLSfoSN1l582ycf8CvThLTjZfPb_TnIMs3497bW6gdXmS8hcvYg/viewform\">Register Here<a/></p>   <h4 class=\"news-post-header\"> Call for Sabbatical Project Proposals 2023-2024</h4>   <p class=\"news-post-paragraph\">The call for new sabbatical project proposals for the 2023-2024 program is now open! The deadline for project proposals is Friday August 4th. Please check out the <a target=\"_blank\" href=\"https://brapi.org/sabbaticals\">Sabbatical Info Page </a>on brapi.org for more info, including the project proposal template and judging rubric. If you have a project idea and you would like help finding a collaborator, please contact me, I am here to help. Also, feel free to spread this invitation to your other colleagues and communities. The intention of the sabbatical program is to foster collaboration, and it is a great way to get new people connected to the BrAPI community. </p>"
    },
    "may-11-2023": {
        "ISO8601": "2023-05-11",
        "title": "BrAPI Update - May 2023",
        "date": "May 11, 2023",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\">Authors Note </h4>    <p class=\"news-post-paragraph\">** Authors Note: Apologies for the delay on some of this information, particularly the hackathon debrief. I had most of this newsletter written weeks ago. Then, something distracted me and it was left sitting forgotten on my computer desktop. Here it is now, better late than never!</p>    <h4 class=\"news-post-header\">Hackathon Debrief </h4>    <p class=\"news-post-paragraph\">In March, we successfully completed the latest BrAPI hackathon in Greenville, South Carolina, USA. This was the first in-person BrAPI hackathon in over three years, since February 2020 in Hyderabad. This was a smaller event than past in-person hackathons, about 20 attendees total. Even so, it was a very fun and productive week of hacking. The lower attendance rate was expected as the world continues to recover from the stress of the pandemic. I hope to see more of the community in person at the Spring 2024 hackathon.</p>    <p class=\"news-post-paragraph\">A complete hackathon debrief is <a target=\"_blank\" href=\"https://brapi.org/news/may-9-2023\">available here<a/> on the BrAPI News page.</p>    <h4 class=\"news-post-header\">Recent Events</h4>    <p class=\"news-post-paragraph\">It is conference season here in the US and I have several events, past and upcoming, I wanted to report on. All of these events, past and upcoming, are available on <a target=\"_blank\" href=\" https://brapi.org/events\">the Events page<a/></p>    <p class=\"news-post-paragraph\">Immediately after the hackathon in South Carolina, I flew to San Antonio, Texas, for the AGBT Ag conference. This was a good meeting, though it was highly science focused and less technology focused. I still had some good interactions, did a flash talk, and presented a new BrAPI Poster, <a target=\"_blank\" href=\"https://brapi.org/docs/BrAPI_Poster_AGBT.pdf\">available here<a/>. This was a good outreach event and I look forward to several follow up conversations with new groups joining the BrAPI community.</p>    <p class=\"news-post-paragraph\">In April, I presented a webinar as part of the EMBL-EBI webinar series \"Plants: a data sciences perspective\". I am honored that they asked me to participate in this training series. There were about 60-70 attendees present online from around the world, and I was able to present the BrAPI project and community. Check out <a target=\"_blank\" href=\"https://doi.org/10.6019/TOL.BrAPI-w.2023.00001.1\">the event page<a/> for details and the recording. </p>    <p class=\"news-post-paragraph\">Last week, I joined members of the <a target=\"_blank\" href=\"https://www.agbiodata.org/\">AgBioData<a/> community in Chicago, for an in-person workshop. The <a target=\"_blank\" href=\"https://www.agbiodata.org/\">AgBioData<a/> community represents a number of genomic databases across the US. I have been part of this community for over a year now, representing the BrAPI project, as well as participating in their Data Federation working group. This workshop in Chicago brought together the different working groups and stake holders of the community to share progress and ideas. While I did not have an opportunity to formally present BrAPI during this event, it was still a great networking opportunity, and a chance to put faces to some of the names I have only talked to online.</p>    <p class=\"news-post-paragraph\">There are a couple more events upcoming to watch out for. This week, I will be going to the <a target=\"_blank\" href=\"https://www.agdatacoop.org/conference\">inaugural NAPDC conference<a/> in Lincoln, Nebraska. This event promise to share \"… thoughts and perspectives on the future of agricultural cyberinfrastructure…\", which seems like something we want BrAPI to be a part of. I plan on presenting the <a target=\"_blank\" href=\"https://brapi.org/docs/BrAPI_Poster_AGBT.pdf\">BrAPI Poster<a/> again and connecting with more key stakeholders. </p>    <p class=\"news-post-paragraph\">And finally, on June 7th, I will be giving a second webinar on BrAPI as part of the <a target=\"_blank\" href=\"https://www.agbiodata.org/\">AgBioData<a/> Monthly Webinar series. If you missed the EMBL-EBI webinar, then this will be your chance to join and submit some really difficult questions for me to try to answer live. </p>    <p class=\"news-post-paragraph\">BrAPI Update News Letter Easter Egg! Congratulations, you found the Easter Egg! Send me a Slack message or email with the word \"germplasm\" and get public recognition for actually reading the news letter!</p>    <h4 class=\"news-post-header\">BrAPI Paper v2</h4>    <p class=\"news-post-paragraph\">During the hackathon, one of the discussion sessions was concerning the writing of a new BrAPI manuscript. This has been a topic that has been discussed in the community for several months. During the hackathon session, we took the first steps to write this new paper. We have a working outline and a new repository setup with ManuBot, a tool for writing collaboratively. The main goal of this new paper is to highlight the practical value of BrAPI for breeders and scientists. We are looking for 6-8 BrAPI use cases or tools that can improve the work and life of the end users. We ultimately want to show the usefulness and impact of BrAPI on the wider scientific community. If you have anything (use cases, tools, success stories, etc) you would like to contribute to this paper, please contact me or leave an issue on the manuscript repository. </p>    <h4 class=\"news-post-header\">Website updates</h4>    <p class=\"news-post-paragraph\">Our community website, <a target=\"_blank\" href=\"https://brapi.org\">brapi.org<a/> has had a couple of small upgrades recently. First, the <a target=\"_blank\" href=\"https://brapi.org/servers\">Community Servers page<a/> has been reorganized. All the servers are now available to view, and a simple search function has been added for finding specific data sources. Additionally, a query is made against each server on page load, and the server status is indicated by an icon next to the URL. This will make it easier to find servers that are actually running without needing to check each one. If you have a server in this list, please take a look to make sure your information is being displayed correctly. If you have a data server you would like to advertise to the community, consider filling out the form on that page to submit your data source to the list.</p>    <p class=\"news-post-paragraph\">Second, for those who are not aware, the new <a target=\"_blank\" href=\"https://brapi.org/compatibleSoftware\">BrAPI Compatible Software page<a/> is now public. This page is intended to present and promote all the software in this community that is BrAPI compatible. I encourage everyone to go explore this list and find some new software you might not have been aware of before. Again, if you have software posted on this list, please double check to make sure it is presented correctly. If you have a piece of software that is BrAPI compatible in any way, please consider submitting it to be presented on this page. </p>    <p class=\"news-post-paragraph\">If you have any suggests or comments on how to improve the website or new tools you would like to see, please contact me or create an issue on <a target=\"_blank\" href=\" https://github.com/plantbreeding/brapi-website/issues\">the website GitHub page<a/>.</p>    <h4 class=\"news-post-header\">Request for comments</h4>    <p class=\"news-post-paragraph\">Please review the following issues on GitHub. If the issue has an impact on your work, please consider leaving a comment on the issue. This could be a clarifying question, some constructive criticism, or simply a \"thumbs-up\" emoji to show you approve of the proposed change. Any feedback from the community helps to prioritize issues for future releases of the BrAPI Spec.</p>    <p class=\"news-post-links\"><a target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/issues/568\">#568 - mkaranja - add endpoints for orders requests between organizations/ stations<a/>    <a target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/issues/565\">#565 – aliceboizet - Add new endpoint /search/method<a/>    <a target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/issues/564\">#564 – BrapiCoordinatorSelby - Directly link Germplasm to the source Cross<a/> </p>"
    },
    "may-09-2023": {
        "ISO8601": "2023-05-09",
        "title": "Greenville Hackathon Debrief",
        "date": "May 9, 2023",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\">Authors Note </h4><p class=\"news-post-paragraph\">** Authors Note: Apologies for the delay on the hackathon debrief. I had most of the newsletter written weeks ago. Then, something distracted me and it was left sitting forgotten on my computer desktop. Here it is now, better late than never!</p><h4 class=\"news-post-header\">Hackathon Debrief </h4><p class=\"news-post-paragraph\">In March, we successfully completed the latest BrAPI hackathon in Greenville, South Carolina, USA. This was the first in-person BrAPI hackathon in over three years, since February 2020 in Hyderabad. This was a smaller event than past in-person hackathons, about 20 attendees total. Even so, it was a very fun and productive week of hacking. The lower attendance rate was expected as the world continues to recover from the stress of the pandemic. I hope to see more of the community in person at the Spring 2024 hackathon.</p><h4 class=\"news-post-header\">Discussions </h4><p class=\"news-post-paragraph\">Beyond the normal discussion topics available at every BrAPI hackathon (Community Updates, BrAPI 101 class, etc) there were a few discussions unique to this event. On Tuesday, we focused on BrAPI community opportunities, including an update on the BrAPI Sabbaticals program and a discussion about collaborating on a new, updated, manuscript. Both sabbatical projects are on track and progressing well. After both projects have wrapped, I will be organizing a public demo day sometime in June so both teams have an opportunity to show off their work to the community. Shortly after that, I will put out the call for new project proposals as we enter the next round of sabbatical projects. For more details regarding sabbaticals, please watch the <a target=\"_blank\" href=\"https://youtu.be/y71iB3D04eM\">discussion recording here </a>.</p><p class=\"news-post-paragraph\">There are more details regarding the updated BrAPI paper below, and the recording from that <a target=\"_blank\" href=\"https://youtu.be/WtV3svshC8k\">discussion is available here </a>.</p><p class=\"news-post-paragraph\">On Wednesday, we focused on updates from the GraphQL and Analytics working groups, as well as a demo of the BrAPI-Sync project. The GraphQL working group continues to make progress in extracting the BrAPI data model from the RESTful specification, and implementing it in a number of graph structured applications (<a target=\"_blank\" href=\"https://youtu.be/hxoRifibX6E\">discussion recording </a>). During the Analytics discussion, we heard a presentation from James Clevenger on the data lake concept for storing and cataloging data for easy analytics. Though this is not strictly speaking related to BrAPI, it was a good discussion on alternate analytics use cases and how APIs and historic data can work together to solve problems (<a target=\"_blank\" href=\"https://youtu.be/rCfVhIw0fdc\">discussion recording </a>). The BrAPI-Sync project, developed by the IBP BMS team, is a major milestone for the BrAPI project. Providing the ability to transfer germplasm and studies from one server to another, it represents one of the earliest use cases BrAPI was originally built for. While the project has some minor work left, it is ready and available for production. See the <a target=\"_blank\" href=\"https://youtu.be/FRFuS2qUHF0\">session recording here </a>.</p><p class=\"news-post-paragraph\">On Thursday, the focus was on the state of the specification, with a discussion on V2.1 adoption and a discussion reviewing specific GitHub issues. These discussions both touched on a variety of topics, though the general theme was concerned with the use of controlled vocabularies, when they are necessary versus when they are too restrictive. Both of these discussion recordings are available <a target=\"_blank\" href=\"https://youtu.be/c7e_MKaOZ54\">here </a> and <a target=\"_blank\" href=\"https://youtu.be/rI6Tu6Zr8j8\">here </a> respectively.</p><h4 class=\"news-post-header\">Projects </h4><p class=\"news-post-paragraph\">On Friday, as always, was the time for project presentations and an opportunity for everyone to show off what they were working on during the week. There are too many project for me to highlight them all in this newsletter, and I encourage everyone to watch the <a target=\"_blank\" href=\"https://youtu.be/QKk-VbMtloI\">project presentations recording </a>. I have picked three projects to highlight: Field Book Plugins, Flapjack Upgrade, and ClimMob BrAPI Compatibility. </p><p class=\"news-post-paragraph\">Chaney Courtney spent the hackathon working on a new, and very cool, feature for the Field Book app. He wanted the ability to create plugins for the base app, potentially using the BrAPI data model for the intra-app communication. This feature would enable anyone to write their own android app for collecting specific types of data. The custom app could be launched as a plugin from Field Book, the specific data is collected, then returned and stored in Field Book as an observation. For example, a light weight image analysis tool, external data connectors, and hardware peripherals could all be custom built as Field Book plugins, without the need to update the root code base. This work is still under construction, but the demo at the end of the hackathon showed some exciting progress.</p><p class=\"news-post-paragraph\">Becky Smith and Terry Casstevens brought together the JHI and Buckler Lab teams to work on Flapjack, the genotype visualization and analysis tool. Flapjack is one of the oldest BrAPI compatible tools, originally compatible with a version of the specification that predates v1.0. However, in recent years, the tool has fallen behind as the genotyping section of the specification has greatly improved. Becky and Terry focused on bringing the BrAPI compatibility of Flapjack up to the most recent version v2.1. Unfortunately, they had to work through a pile of frustrating bugs, most unrelated to the task at hand, just to refactor some of this old code. But the team persevered, and they were able to demo a functional Flapjack pulling live data from the v2.1 BrAPI test server. </p><p class=\"news-post-paragraph\">Finally, Carlos Quiros joined us with his project ClimMob, a tool built to collect comparative trait data from citizen scientists and real farmers' fields.  I have had theoretical discussions with Carlos in the past on how ClimMob data could be mapped to the BrAPI spec and transferred to a central database for further processing and study. This hackathon finally gave Carlos and his team the opportunity to begin working on their own BrAPI implementation. As many of us know, mapping from an existing data structure to the BrAPI schema can be the most difficult part of the process. That was the main achievement for Carlos during the hackathon, creating a first draft of the mapping between ClimMob data and BrAPI. Now, there are a number of use cases the ClimMob team can explore in terms of automating data flow between their tool and other BrAPI compatible databases. </p><h4 class=\"news-post-header\">Notes and Recordings </h4><p class=\"news-post-paragraph\">All the notes, slides, and recordings from the hackathon are available on <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-mar-2023#notes-section\">brapi.org </a>. We will continue the pattern of mixing in-person and virtual hackathons to achieve the best of both types. The next BrAPI hackathon will be virtual and will take place sometime in October of 2023. The official dates will be announced later.</p>"
    },
    "feb-17-2023": {
        "ISO8601": "2023-02-17",
        "title": "BrAPI Update - February 2023",
        "date": "February 17, 2023",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\">  Hackathon Registration Reminder and Virtual Attendance  </h4>    <p class=\"news-post-paragraph\">  There are still plenty of seats available for Greenville hackathon, coming up on March 20-24. This will be an exciting event as we gather the community for the first time in 3 years. If you can, I encourage you to attend in-person and join us as we reinforce social bonds and strengthen the BrAPI community.   <br>  If you can't make it in-person, there will be an option to connect virtually to the event. Discussion sessions will have a virtual component, allowing everyone's voice to be heard, whether or not you can be there in-person.   <br>  If you would like to attend the hackathon <span style=\"font-weight:bold;\"> in-person or virtually </span> please <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-mar-2023\"> register here </a> as soon as possible. There is an option when submitting the form to indicate your virtual presence. It is essential that everyone attending virtually still registers so that you can receive instruction on how to connect. If you have any questions or concerns, please <a target=\"_blank\" href=\"https://brapi.org/contact\"> contact Peter Selby </a>.   </p>    <h4 class=\"news-post-header\">  <a target=\"_blank\" href=\"https://brapi.org/events\"> Other Upcoming Events </a>  </h4>    <p class=\"news-post-paragraph\">  In the week following the hackathon, the <a target=\"_blank\" href=\"https://www.agbt.org/events/agricultural-meeting-overview\"> AGBT Ag Conference </a> will be taking place in San Antonio, Texas, USA. The BrAPI Project and Community will be presented on Wednesday, March 29, with a lightning talk and poster session. If you are attending the AGBT event, please stop by the poster session and say \"hi\" to Peter. He will be fielding questions and discussing new ideas for project collaboration.   <br>  Then, almost a month later, Peter will be presenting an hour long webinar on BrAPI, as part of the <a target=\"_blank\" href=\"https://www.ebi.ac.uk/training/events/applications-and-impacts-brapi-project-plant-breeding/\"> EMBL-EBI 2023 Plant Webinar Series </a>. The full webinar series runs from March 1 through May 10, and will have 9 speakers focused on the intersection between plant science and data science. The whole series is free to attend. The BrAPI session, on April 26, will focus on the applications and impacts so far that BrAPI has had on the plant breeding community. It will include many examples and success stories from the community.   </p>"
    },
    "jan-23-2023": {
        "ISO8601": "2023-01-23",
        "title": "BrAPI Update - January 2023",
        "date": "January 23, 2023",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\"> BrAPI Hackathon Registration </h4> <p class=\"news-post-paragraph\"> Registration is OPEN for the upcoming BrAPI hackathon! This event will be March 20-24th in Greenville, SC, USA. There are limited seats available, so <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-mar-2023\" style=\"text-decoration: underline;\">register now!</a></p> <p class=\"news-post-paragraph\"> There are a small number of travel grants available for anyone who would not be able to travel without financial assistance. Select the \"Travel Assistance\" box on the registration form and someone will contact you with further instructions.  </p> <p class=\"news-post-paragraph\"> Travel details are available in the \"Travel Guide\" document. Please consult this document for transportation, hotel, and VISA information. If you have any questions, please <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact the BrAPI Coordinator</a>. </p> <h4 class=\"news-post-header\">BrAPI Working Groups </h4> <p class=\"news-post-paragraph\"> There are two new BrAPI working groups starting soon. The GraphQL working group and the Analytics working group will both have their first meetings within the next 2-3 weeks. If you are interested in joining either of these groups, please  <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact the BrAPI Coordinator</a> as soon as possible. </p> <p class=\"news-post-paragraph\"> The GraphQL working group will be focused on developing a standard GraphQL implementation of the BrAPI data models. This might include suggesting modification to the BrAPI models, documenting some GraphQL best practices, and working from a common repository. This group will also need to address the question of how to balance implementations so there is no competition with existing RESTful implementations of BrAPI.</p> <p class=\"news-post-paragraph\"> The Analytics working group will focus on figuring out the best way to add Analytics/Statistical processing and results into BrAPI. They will need to investigate some existing technologies/methodologies, and deliver something that will work for a majority of the BrAPI community. A solution might involve new BrAPI endpoints, links to existing tools, best practices, or all of the above. </p>"
    },
    "jan-10-2023": {
        "ISO8601": "2023-01-10",
        "title": "Hackathon - Greenville March 2023 - Announcement",
        "date": "January 10, 2023",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\"> Save the date! <br> The next Virtual BrAPI Hackathon will be March 20-24, 2023 in Greenville SC, USA! <br> <a target=\"_blank\"         href=\"https://brapi.org/events/hackathon-mar-2023\" style=\"text-decoration: underline;\">Register Here!</a> </h4> <p  class=\"news-post-paragraph\"> Join the BrAPI community for a week of fun as we hack code together and discuss the future of BrAPI. This hackathon will be in Greenville, South Carolina, USA on March 20-24, 2023. A big \"thank you\" to Trevor Rife and Clemson University for hosting this event. Everyone in the BrAPI community is welcome! Please register to receive meeting invitations and other important information. </p> <h4 class=\"news-post-header\">Overview</h4> <p  class=\"news-post-paragraph\">The BrAPI Community Hackathon is an event focused on bringing together the BrAPI community. This week-long event will provide time for the members of the community to discuss the BrAPI specification, collaborate on projects, socialize and learn from each other. The hackathon is largely self-organizing project work time, with a few scheduled public discussion sessions addressing important community topics. The overall goal is to be as productive as possible in a small window of time, to explore ideas and start on collaborative projects that can be more formally developed after the event. </p> <h4 class=\"news-post-header\">Get Prepared</h4> <p  class=\"news-post-paragraph\"\">Start thinking about projects and planning collaborative groups now. Your project can be     anything related to BrAPI. Add BrAPI to an existing tool or server, develop a new BrAPP idea, create an automated     connection with another tool/group, work on a BrAPI development assistance tool/library, or design a new BrAPI     concept/interface. On the last day of the hackathon, there will be an opportunity to present what your group has     accomplished, so be prepared to show progress by the end of the week. If you do not have a project idea, that is ok     too. There will be a list of general community projects available for anyone to work on. There are many different     ways to contribute! </p> <p  class=\"news-post-paragraph\">This is our first in-person hackathon since 2020. That means long distance travel, and for some people this will be the first time traveling since the pandemic. If you have any questions or concerns about traveling, or if you need assistance making travel arrangements, please contact me.  </p> <p  class=\"news-post-paragraph\"><a target=\"_blank\" href=\"https://brapi.org/events/hackathon-mar-2023\">Register Here! </a>     Look for more announcements on the <a target=\"_blank\"         href=\"https://brapi.org/contact\">mailing list, </a><a target=\"_blank\"         href=\"https://join.slack.com/t/plantbreedingapi/shared_invite/enQtNjA4NTA3OTI5NjUxLWE5ZmI0NDE0NGM1ODkxMjVmMDU1MGVjY2Q5M2QxNGNkYzMyODhkNDVmZjM0ZGI1YzEwYjEwNmY0MDM1YjllZDU\">Slack         channel</a>, and <a target=\"_blank\" href=\"https://twitter.com/breedingapi\">Twitter</a>. Feel free to forward     this message on to other interested groups and communities. </p>"
    },
    "nov-16-2022": {
        "ISO8601": "2022-11-16",
        "title": "Community Announcement – New BrAPI Advisory Board Members",
        "date": "November 16, 2022",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\">Hello BrAPI Community, </h4> <p class=\"news-post-paragraph\"> I am pleased to announce that <span style=\"font-weight: bold\">Shawn Yarnes and Sebastian Beier</span> have been elected as the new members of the BrAPI advisory board. They will each serve a three-year term on the board as representatives and leaders within the community. </p> <p class=\"news-post-paragraph\"> Thank you to everyone who voted in this first election. You can view the tallied results at the link below. If you have any feedback on how to make this process better, please let me know. </p> <p class=\"news-post-links\"> <a target=\"_blank\" href=\"https://app.rankedvote.co/decisions/24518/BrAPI-Advisory-Board-2022/25370/results\">Election Results</a></p>"
    },
    "nov-10-2022": {
        "ISO8601": "2022-11-10",
        "title": "BrAPI Update - November 2022",
        "date": "November 10, 2022",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\">Hackathon Debrief </h4><p class=\"news-post-paragraph\">Another BrAPI Hackathon has come and gone, and with it an exciting collection of projects and discussions. This was a smaller event than past virtual hackathons, with 45 attendees from 20 different organizations. However, despite the smaller numbers, we continue to maintain good community growth, as one third of the attendees were new to BrAPI. I hope these new members found the hackathon productive and insightful and I hope to see everyone back for the next one. Below are a few highlights from the week, topics that were particularly popular or interesting. However, these are not the only achievements of the week. If you are interested, all of the notes, slides, and recorded sessions are available on the hackathon web page on brapi.org. Feel free to <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact me</a> if you are looking for something specific in the notes, or if you would like to get in touch with any of the project groups.</p><p class=\"news-post-paragraph\">The mobile application Field Book was a popular topic this year with at least four different project groups focusing on different parts of the app. One group was focused on getting the app connected to their own database, while other groups were making enhancements to the BrAPI related functionality. In a future version of Field Book, you should be able to collect and upload multiple observations, across different levels (plot, sub-plot, plant) and across time points for the same entity. In addition, existing observations on a server can now be synced with a device, paving the way for a continuous connection with the server, data flowing back and forth as soon as it is collected. These enhancements should enable an enormous amount of flexibility for breeders and the techniques they use for collecting field data.</p><p class=\"news-post-paragraph\">One of the big new features of BrAPI V2.1 was the expansion of the Pedigree data model. Several groups used the hackathon as an opportunity to explore and implement these new features. One group implemented the new endpoints on their servers against existing data. Another group focused on consuming pedigree data in an analysis support application. And a third group tackled the challenge of transferring pedigree data from one database to another, overcoming all the possible scenarios of records missing, overlapping, duplicated, and disagreeing. So far, the new V2.1 spec seems to be up to the challenge of handling all the different use cases.</p><p class=\"news-post-paragraph\">The other big new feature released with V2.1 was the creation of the Allele Matrix data model. This was a long awaited enhancement to the genotyping data in BrAPI, and several groups used the hackathon to jump on the opportunity. Some groups implemented the new endpoint on their database to serve variant data dynamically and efficiently. Other groups worked on existing genotype visualization apps, taking full advantage of the faster servers now available. At the end of the week, I was excited to see the first real examples of performance improvement we had hoped to see with the release of BrAPI V2.1.</p><p class=\"news-post-links\">  <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2022#notes-section\">Virtual Hackathon Notes and Recordings</a></p><h4 class=\"news-post-header\">Working Group Opportunities  </h4><p class=\"news-post-paragraph\">Following the success of the previous BrAPI community working groups last year, we wanted to start two new working groups. If you are interested in joining either of these groups, please <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact me</a>. With the holidays and the end of the year affecting everyone's schedules, I hope to setup the first meetings for both groups sometime in early January.</p><p class=\"news-post-paragraph\">The first group will focus on Analytics in BrAPI. This has been a slow, on-going discussion within the community and it is now time to assign a focused group to develop a concrete solution. This working group will be looking at how to model the analytical workflows, as well as the post-analysis output data that might need to be stored and reused. Some types of analysis already fit well into the BrAPI schema, other types of analysis already have standard models and data types built by other groups. The primary objective for the Analytics Working Group will be to understand and categorize the different types of analytical models, review other existing specifications, and develop a plan for how to standardize common analytics problems within the BrAPI community.</p><p class=\"news-post-paragraph\">The second new working group will focus on GraphQL. GraphQL is web service framework and an alternative to REST. GraphQL provides much more flexibility than REST when querying data, but requires a more complex server-side implementation to work correctly. Several groups within the community are interested in setting up BrAPI compatible GraphQL systems, maintaining the standard data models while adding more flexible querying capabilities. The primary objective for the GraphQL Working Group will be to explore the creation of a GraphQL library. Such a library might rely on auto-generation tools, and might require changes to the BrAPI data models to work effectively. A secondary objective for this working group will be to explore the possibilities for how a GraphQL system and a REST system might interact, both from a server implementation and from a client application consuming data.</p><p class=\"news-post-paragraph\">If either of these groups sounds interesting to you, please <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact me</a> and I will add your name to the list. </p><h4 class=\"news-post-header\">Sabbatical Proposals  </h4><p class=\"news-post-paragraph\">Remember that the deadline for project proposals for the BrAPI Sabbatical Program is <span style=\"font-weight:bold;\">November 18</span>. If you plan to submit a proposal, but you do not think you will make this deadline, please <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact me</a>. I am here to help in any way I can to make a potential project happen. If you would like to travel with a project idea, but you have nowhere to go, <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact me</a>. If you are an institution willing to host with a project idea, but no traveler, <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact me</a>. I am very excited about this program and I want to see it succeed.</p><p class=\"news-post-links\">  <a target=\"_blank\" href=\"https://brapi.org/sabbaticals\">Sabbatical Info Page</a></p><h4 class=\"news-post-header\">Vote for BrAPI Advisory Board </h4><p class=\"news-post-paragraph\">The polls are currently open for the election of two new members to the BrAPI advisory board. If you have not already, please take a few minutes to <a target=\"_blank\" href=\"https://brapi.org/advisoryBoardCandidates\">review the candidates</a> and <a target=\"_blank\" href=\"https://app.rankedvote.co/decisions/24518/BrAPI-Advisory-Board-2022/25370/vote\">vote</a>! These are the people who will represent the community in the BrAPI project leadership. Voting will end in less than a week, on <span style=\"font-weight:bold;\">November 15</span>. </p><p class=\"news-post-links\">  <a target=\"_blank\" href=\"https://brapi.org/advisoryBoardCandidates\">Review Candidates</a><a target=\"_blank\" href=\"https://app.rankedvote.co/decisions/24518/BrAPI-Advisory-Board-2022/25370/vote\">Vote</a></p><h4 class=\"news-post-header\">Community Spotlight – BrAPI-Sync </h4><p class=\"news-post-paragraph\">For this BrAPI update, I am shining the spotlight on the BrAPI-Sync application developed by the Integrated Breeding Platform (IBP) development team. BrAPI-Sync is an open source, single-page, BrAPP, written using the Angular.js framework. This tool enables automated synchronization of data between any two BrAPI enabled databases. More specifically, the IBP team built this app in response to a problematic use case they were dealing with; a network of breeding programs contributing to the same large-scale study. Each breeding program had its own database to collect data locally, but they needed an efficient way to collect all of the data into a single parent system. Thus, the BrAPI-Sync tool was created to synchronize all of the individual program databases with the parent database. The tool provides a simple UI for transferring germplasm, study, and observation data. As of the most recent hackathon (October 2022), the IBP team has enhanced the tool to transfer properly structured pedigree information as well. The team will continue to enhance the tool as needed for their own use cases, and they are open to contributions from other groups.</p><p class=\"news-post-links\">  <a target=\"_blank\" href=\"https://github.com/IntegratedBreedingPlatform/brapi-sync\">BrAPI-Sync GitHub</a></p><h4 class=\"news-post-header\">Request for Comments </h4><p class=\"news-post-paragraph\">Please review the following issues on GitHub. If the issue has an impact on your work, please consider leaving a comment on the issue. This could be a clarifying question, some constructive criticism, or simply a \"thumbs-up\" emoji to show you approve of the proposed change. Any feedback from the community helps to prioritize issues for future releases of the BrAPI Spec.</p><p class=\"news-post-links\">  <a target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/issues/552\">#552 - sebastian-raubach - Add endpoint for authentication info </a><a target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/issues/555\">#555 - daveneti - Add generationCode to Germplasm </a><a target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/issues/559\">#559 - aliceboizet - Add \"externalURL\" field to externalReference model </a></p>"
    },
    "nov-01-2022": {
        "ISO8601": "2022-11-01",
        "title": "Community Announcement – BrAPI Advisory Board Polls Are Open",
        "date": "November 1, 2022",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\"><a target=\"_blank\" href=\"https://app.rankedvote.co/decisions/24518/BrAPI-Advisory-Board-2022/25370/vote\">Vote Now! </a></h4>  <p class=\"news-post-paragraph\">The polls are open for selecting two new members of the BrAPI Advisory Board. Please visit the <a target=\"_blank\" href=\"https://brapi.org/advisoryBoardCandidates\">Candidate Info Page</a> to read about the candidates, and go to the link below when you are ready to vote. Voting will end on November 15. </p><p class=\"news-post-paragraph\"><a target=\"_blank\" href=\"https://app.rankedvote.co/decisions/24518/BrAPI-Advisory-Board-2022/25370/vote\">https://app.rankedvote.co/decisions/24518/BrAPI-Advisory-Board-2022/25370/vote</a></p>  <p class=\"news-post-paragraph\">This is a big step for the BrAPI Community. This election marks the beginning of the formalized BrAPI Advisory Board, elected as representatives for the community. This board represents the community leadership of the BrAPI project, and offers some balance to the coordinator role. The board will ensure the longevity of the project, providing consistent and empowered community leadership over time, even if the coordinator and project funding change hands. I hope you all take this election seriously and put some thought into who will best represent your interests for the next three years. </p>  <p class=\"news-post-paragraph\">For more information, please visit the <a target=\"_blank\"href=\"https://brapi.org/projectLeadership\">governance page</a> on brapi.org, or watch the recording of the <a target=\"_blank\" href=\"https://youtu.be/OSsafwzZvsI\">BrAPI Advisory Board Informational Session</a> from the most recent hackathon. This is a new process for the community and for me. Thank you for being patient while we figure this out, and please contact me with any comments, questions, or concerns. </p>"
    },
    "oct-16-2022": {
        "ISO8601": "2022-10-16",
        "title": "Community Announcement – BrAPI Sabbaticals",
        "date": "October 16, 2022",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\"> BrAPI Sabbaticals </h4><p class=\"news-post-paragraph\"> I am pleased to announce the beginning of the <a href=\"/sabbaticals\"> BrAPI Community Sabbaticals </a> program. This program enables members of the BrAPI community to take some time off from their normal day-to-day work and visit another BrAPI partner institution. However, this is not a vacation and sabbatical participants will not be idle in their time off. During their time away, they will be working with the host institution on a constructive project that benefits both groups. The intention of this program is to encourage community building and collaborative projects with shared resources. The sabbatical is an opportunity to learn from each other and build connections between groups. The tools, knowledge, and connections produced from each sabbatical will improve the BrAPI project and community. </p><p class=\"news-post-paragraph\"> For more information, and instructions on how to submit a project proposal, please go to the new <a href=\"/sabbaticals\"> BrAPI Sabbaticals </a> web page on brapi.org. There you will find the project proposal template and rubric. The deadline for project proposals this year is Nov 18, 2022, meaning sabbaticals can start in the first half of 2023. If you have any questions, comments, or suggestions, please contact me at <a href=\"mailto:brapicoordinatorselby@gmail.com\"> brapicoordinatorselby@gmail.com </a>. I am available to help organize project proposals and to help bring together project ideas, hosts institutions, and travelers. </p>"
    },
    "oct-10-2022": {
        "ISO8601": "2022-10-10",
        "title": "Hackathon - Virtual October 2022 - Update",
        "date": "October 10, 2022",
        "author": "Peter Selby",
        "article": " <p>We are only two weeks away from the next BrAPI Virtual Hackathon! Please remember to <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2022\"> REGISTER </a> if you have not already. The hackathon is free to attend for everyone, but registered attendees will be sent announcements, schedule updates, and meeting links directly. </p><p>Please visit the <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2022\"> hackathon web page</a> for all the details you need to stay informed about the hackathon. Go to <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2022\"> brapi.org/events/hackathon-oct-2022 </a> to check it out, and please check this page regularly as it is subject to change without warning. On this page, you can find the following:</p><ul><li> An <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2022#overview-section \"> Overview </a> of the hackathon, and a link to register. This includes a lot of the same information included in the hackathon announcement email. </li><li> The hackathon <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2022#agenda-section \"> Agenda </a> of public discussion topics. The agenda is broken into two duplicate sessions, eight hours apart, to try to accommodate as many time zones as possible. The agenda outlines the major community discussion topics, but all attendees are encouraged to reserve the whole week for the hackathon. The goal is to divide time evenly between general community discussions, and project work time. The BrAPI hackathon can be both a venue of communication and a productive technical work environment. </li><li> The public <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2022#attendees-section \"> Attendees List </a> is something new to this hackathon. This should keep everyone informed on who is planning to attend and which organizations will be represented. Knowing ahead of time who will be attending can be very useful for planning projects and knowing what can be accomplished in a short week. During registration, there is an option not to be included publicly on this list if desired. </li><li> The list of <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2022#projects-section \"> Projects List </a> presents all the project ideas attendees will be working on during the hackathon. This can provide ideas to other groups, or provide collaboration opportunities for participants looking for a project to work on. </li><li> Finally, the <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2022#notes-section\"> Notes and Recordings </a> section is currently empty, but it will become populated with the outcomes of each discussion on the agenda. Hopefully, this will prove useful for people who are unable to attend, or as a reference to look back on discussions and community decisions that were made. </li></ul><p></p>"
    },
    "sep-12-2022": {
        "ISO8601": "2022-09-12",
        "title": "BrAPI Update – September 2022 ",
        "date": "September 12, 2022",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\">Advisory Board Nominations</h4>     <p class=\"news-post-paragraph\">The BrAPI Advisory Board is looking for new members! We are looking for 1-2 new members to join the board as leaders in the BrAPI Community. This is the beginning of a turnover process where older members of the board step down and new people step up to help guide the BrAPI project and the community. The time commitment for this role is only about 4-8 hours per year and is open to anyone in the BrAPI community. The board meets quarterly to discuss the long-term goals of the project, and board members may be asked for additional feedback and advice on important community decisions throughout the year. </p>  <p class=\"news-post-paragraph\">To nominate yourself, please complete a copy of the <a href=\"https://brapi.org/docs/BrAPI_Advisory_Board_Candidate_Report_TEMPLATE.docx\">Advisory Board Candidate Report</a> and send it to the <a href=\"mailto:brapicoordinatorselby@gmail.com\">BrAPI Project Coordinator</a>. To nominate someone else, please send their name and contact details to the <a href=\"mailto:brapicoordinatorselby@gmail.com\">BrAPI Project Coordinator</a>. The Coordinator will reach out to the nominee and collect more information as needed. </p>  <p class=\"news-post-paragraph\">For more information about the advisory board and the nomination process, please visit the <a href=\"https://brapi.org/projectLeadership\">Project Governance</a> page and the <a href=\"https://brapi.org/brapiAdvisoryBoard\">Advisory Board Responsibilities</a> page on brapi.org. There will also be an informational session on this topic during the upcoming <a href=\"https://brapi.org/events/hackathon-oct-2022\">Oct 2022 hackathon</a>. Finally, as always, please <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact me</a> directly with any questions, concerns, or feedback. </p>    <p class=\"news-post-links\">    <a target=\"_blank\" href=\"https://brapi.org/docs/BrAPI_Advisory_Board_Candidate_Report_TEMPLATE.docx\"> Nomination Report Template </a>    <br><a  target=\"_blank\" href=\"https://brapi.org/brapiAdvisoryBoard\"> Advisory Board Responsibilities</a>    <br><a  target=\"_blank\" href=\"https://brapi.org/projectLeadership\"> BrAPI Project Governance </a>    </p>      <h4 class=\"news-post-header\"> Virtual Hackathon</h4>   <p class=\"news-post-paragraph\">The next virtual hackathon will be October 24-28, 2022. <a href=\"https://brapi.org/events/hackathon-oct-2022\"> Register now</a> and reserve your seat at the virtual table. The hackathon will be a week focused on developing BrAPI projects and discussing how to improve the specification and community. Join us and use this time to collaborate on a group project, show off something you have been working on, or make your voice heard and propose an important discussion topic to the community.</p>    <p class=\"news-post-links\">    <a target=\"_blank\" href=\"https://brapi.org/news/aug-29-2022\"> Original Announcement </a>    <br><a  target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2022\"> Register Here </a>  </p>    <h4 class=\"news-post-header\"> BrAPI Glossary Tool </h4>   <p class=\"news-post-paragraph\">Those who have been watching the <a href=\"https://join.slack.com/t/plantbreedingapi/shared_invite/zt-7rjlwrhv-qftEFExYkSXwVQ7M2T0UzQ\">BrAPI Slack channel</a> recently may have seen some chatter about a glossary of BrAPI terms. I am happy to report that the first draft of this glossary is now available. This glossary is still a prototype and there is a lot of room for improvements. If you have feedback, issues, or suggested enhancements, there is a link to the Github issues board at the bottom of the page. I foresee this tool being integrated with other community tools such as the <a href=\"https://plantbreeding.github.io/brapi-ontology/\">Data Type Browser</a> or the <a href=\"https://plantbreeding.github.io/brapi-ontology/uml.html\">BrAPI ERD</a>, and one day we will have a complete BrAPI ontology with synonyms and strong connections to other well-defined vocabularies. Perhaps some of this work could be an interesting hackathon project. </p>    <p class=\"news-post-links\">    <a target=\"_blank\" href=\"https://plantbreeding.github.io/brapi-ontology/glossary.html\"> BrAPI Glossary </a>  </p>"
    },
    "aug-29-2022": {
        "ISO8601": "2022-08-29",
        "title": "Hackathon - Virtual October 2022 - Announcement",
        "date": "August 29, 2022",
        "author": "Peter Selby",
        "article": "<h4> Save the date! The next Virtual BrAPI Hackathon will be October 24-28, 2022! <br/>  <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2022\" style=\"text-decoration: underline;\">Register Here!</a> Agenda and other details are coming soon. </h4>  <h4>Overview</h4>  <p style=\"margin-left: 15px;\">The BrAPI Community Hackathon is an event focused on bringing together the BrAPI community. This week-long event will reserve time for the members of the community to discuss the BrAPI specification, collaborate on projects, socialize and learn from each other. The hackathon is largely self-organizing project work time, with a few scheduled public discussion sessions addressing important community topics. The overall goal is to be as productive as possible in a small window of time, to explore ideas and start on collaborative projects that can be more formally developed after the event. </p>  <h4>Get Prepared</h4>  <p style=\"margin-left: 15px;\">Start thinking about projects and planning collaborative groups now. Your project can be anything related to BrAPI. Add BrAPI to an existing tool or server, develop a new BrAPP idea, create an automated connection with another tool/group, work on a BrAPI development assistance tool/library, or design a new BrAPI concept/interface. On the last day of the hackathon, there will be an opportunity to present what your group has accomplished, so be prepared to show progress by the end of the week. If you do not have a project idea, that is ok too. There will be a list of general community projects available for anyone to work on. There are many different ways to contribute! </p>  <p style=\"margin-left: 15px;\">One major take away from previous virtual hackathons was that attendees were feeling distracted by other work. If you can, try to reserve the whole week in your schedule so normal work does not intrude on the project work time. Of course, deadlines and emergencies happen, and BrAPI will not always be the top priority. This is just a reminder that you will get more out of the virtual hackathon experience if you can dedicate the time to focus on it. </p>  <p style=\"margin-left: 15px;\"><a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2022\">Register Here! </a> Agenda and other details are coming soon. Look for more announcements on the <a target=\"_blank\" href=\"https://brapi.org/contact\">mailing list, <a target=\"_blank\" href=\"https://join.slack.com/t/plantbreedingapi/shared_invite/enQtNjA4NTA3OTI5NjUxLWE5ZmI0NDE0NGM1ODkxMjVmMDU1MGVjY2Q5M2QxNGNkYzMyODhkNDVmZjM0ZGI1YzEwYjEwNmY0MDM1YjllZDU\">Slack channel</a>, and <a target=\"_blank\" href=\"https://twitter.com/breedingapi\">Twitter</a>. Feel free to forward this message on to other interested groups and communities. </p>"
    },
    "aug-02-2022": {
        "ISO8601": "2022-08-02",
        "title": "Community Announcement – BrAPI Hackathon Host Volunteers",
        "date": "August 2, 2022",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\"> Hello BrAPI Community</h4> <p class=\"news-post-paragraph\"> <span style=\"font-weight: bold;\">I am looking for volunteers to host the next in-person BrAPI Hackathon in April 2023! </span> If you and your organization are interested, or if you have any questions, please <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact me</a>. </p> <p class=\"news-post-paragraph\"> Our last in-person event was over two and a half years ago, so here is a reminder of what an in-person BrAPI hackathon typically looks like. Each event typically has 35-45 attendees from all over the world. We will all gather at the host venue for one week, Monday to Friday. The primary focus of the event is always the development of BrAPI related projects and the discussions around the BrAPI specification and community. The hackathons are self-organizing, and there is an expectation that attendees will bring project ideas and discussion topics with them. Visiting a new organization means there are often additional opportunities to learn and collaborate. These opportunities might include a tour of the host's fields and facilities, discussions with other scientists at the organization, and outreach to local industry partners.  </p> <p class=\"news-post-paragraph\"> Being in-person also adds an important social aspect to the event. During tea/coffee breaks and during lunch every day, there are often many social side conversations. These side conversations can lead to new insights and strengthen community bonds. One night during the week, we will organize a community dinner so we can celebrate together as a large group. Other than the community dinner, people usually take the evenings to explore the area in small groups, learning about the local culture and building friendships.  </p> <p class=\"news-post-paragraph\"> In the weeks leading up to the event, I will work directly with the hosts to organize and make sure everything is ready. This will require a moderate time commitment as we work together to finalize the venue and organize attendees. I will ask for hotel recommendations, restaurant suggestions, and local travel options (bus, train, taxi, etc) to provide travel guidance for all the visitors. However, attendees are expected to cover their own travel and hotel expenses, those things are not the host's responsibility. The volunteer host organization is responsible for providing the following: </p> <ul class=\"news-post-links\"> <li> One large room to accommodate 35-45 people </li> <li> One or two smaller break-out rooms </li> <li> Reliable Wifi/internet access for guests (IT support is sometimes required for this) </li> <li> Daily coffee, tea, and snacks for all attendees </li> <li> Daily lunch for all attendees </li> <li> One evening community dinner for all attendees </li> <li> *NEW* Basic COVID-19 protections (masks, hand sanitizer, etc) </li> </ul> <p class=\"news-post-paragraph\"> If you are interested in hosting a BrAPI Community Hackathon at your local organization, please <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact me</a>. Even if we cannot make it work for April 2023, I maintain a list of potential volunteers and we can try a later date. Hosting a hackathon is a very rewarding experience and an excellent way to give back to the community.  </p> <p class=\"news-post-paragraph\"> Thanks <br> <a href=\"mailto:brapicoordinatorselby@gmail.com\">Peter Selby</a> </p> "
    },
    "jul-01-2022": {
        "ISO8601": "2022-07-01",
        "title": "Release - BrAPI V2.1",
        "date": "July 1, 2022",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\">BrAPI V2.1 is officially released!</h4> <p class=\"news-post-paragraph\">  This release contains many smaller updates designed to make BrAPI clearer and easier to use. This release also includes the results from two community working groups, the Genotype Refactoring WG and the Agronomy/Crop Modeling WG. A total of 50 Github issues were resolved as part of this release, and 22 new endpoints were added to the specification. BrAPI now has a total of 197 possible endpoints available. All of the links for all of the documentation for all of the modules can be found at <a target=\"_blank\" href=\"https://brapi.org/specification\">brapi.org/specification</a>. To assist in moving from v2.0 to v2.1, please download <a target=\"_blank\" href=\"https://github.com/plantbreeding/API/releases/download/V2.1/BrAPI_V2-1_Release_Notes.xlsx\"> full change log </a> from the GitHub release notes.  The BrAPI Validator App (BRAVA) and the BrAPI Test Server are both upgraded to support v2.1. Please feel free to use both of these tools as tests and examples as you upgrade your own implementation.</p>  <p class=\"news-post-links\"><a target=\"_blank\" href=\"https://brapi.org/specification\">BrAPI Specification Page</a> <br> <a target=\"_blank\" href=\"https://github.com/plantbreeding/API/releases/download/V2.1/BrAPI_V2-1_Release_Notes.xlsx\"> Change Log </a> </p>  <p class=\"news-post-paragraph\"> Thank you so much to everyone in the BrAPI community who made this possible! I’m very excited to see where the next few years take us! As always, if you have any questions, comments, or concerns, please reach out to me. I am here to help. </p>"
    },
    "jun-24-2022": {
        "ISO8601": "2022-06-24",
        "title": "Community Announcement – BrAPI Funding Update",
        "date": "June 24, 2022",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\">Community Announcement – BrAPI Funding Update</h4><p style=\"margin: 5px 0 0 20px;\"> I am pleased to announce that the USDA National Institute of Food and Agriculture (NIFA) has accepted the BrAPI Project grant proposal. The project now has secure funding from now until June 14, 2026. Over the next 4 years, we will be working diligently to expand the community, enhance the specification, and improve global collaboration. Below is a list of the formal grant objectives. If anyone is interested in more details about the grant or the future of the BrAPI project, please contact me. </p>  <ul class=\"news-post-links\">  <li>Objective 1: Expand the functionality in the RESTful API standard to fully support modern breeding applications. </li>  <li>Objective 2: Implement additional API technologies to achieve optimal performance for a wide range of use cases. </li>  <li>Objective 3: Maintain and expand the project infrastructure, supporting software developers to build implementations of the standard quickly and efficiently. </li>  <li>Objective 4: Provide opportunities for direct collaboration between groups, and provide community-building activities. </li>  <li>Objective 5: Expand the BrAPI community, with a focus on continued diversity and representation of new domains. </li>  </ul>  <p style=\"margin: 5px 0 0 20px;\">  This grant opens several new opportunities for the BrAPI project. Over the next few months, continue to watch the mailing list, Slack channel, and Twitter as we announce several new initiatives and community opportunities. As a preview, below is a list of initiative announcements to watch for in the coming months.  </p> <ul class=\"news-post-links\">    <li> Nominations for representatives in a formal governance body</li>  <li> Volunteers to host in-person hackathons</li>  <li> Opportunities to participate in additional community working groups</li>  <li> Project proposals for community sabbaticals</li>  <li> Opportunities to contribute in an updated BrAPI paper</li>  </ul>  <p style=\"margin: 5px 0 0 20px;\">  I have had the privilege to support this community and watch it grow over the past five years. I am excited to see where these next four (and beyond) will bring us. As always, if you have any comments, questions, or concerns about any of this, please feel free to contact me. </p>  <p style=\"margin: 5px 0 0 20px;\"> Peter Selby </p>"
    },
    "may-31-2022": {
        "ISO8601": "2022-05-31",
        "title": "BrAPI Update - May 2022",
        "date": "May 31, 2022",
        "author": "Peter Selby",
        "article": "<h4 class=\"news-post-header\">Hackathon Debrief</h4>  <p class=\"news-post-paragraph\"> Another productive week of hacking and sharing has come and gone. In April, I was joined by 63 participants from 32 different organizations, dialing in from around the world for another virtual hackathon. About one fourth of the attendees were new to BrAPI, a good sign that our community is still growing. I hope these new members found the hackathon productive and insightful and I hope to see everyone back for the next one.   </p><p class=\"news-post-paragraph\">Below are a few highlights from the week, topics that were particularly popular or interesting. However, these are not the only achievements of the week. If you are interested, all of the notes, slides, and recorded sessions are available on <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-apr-2022#notes-section\">the hackathon web page</a> on brapi.org. Feel free to contact me if you are looking for something specific in the notes, or if you would like to get in touch with any of the project groups.   </p><p class=\"news-post-paragraph\">There was a whole day of discussions dedicated to the current BrAPI working groups. There are three active working groups right now: Genotype Improvements, Agronomy & Crop Modeling, and High Dimensional Phenotyping. Each of these groups had an opportunity to report on the work they have accomplished over the past six months. The Genotype Improvements group has come a long way in making the BrAPI genotyping module more efficient and easier to use. They are testing an implementation of the latest version now, and assuming everything goes well, this will be the final improvement before the release of BrAPI v2.1. The Agronomy & Crop Modeling group has successfully integrated the ICASA standard into the BrAPI Events endpoint. This will support better compatibility between existing tools and systems. Even though the new data models are ready in theory, this group is having some trouble figuring out how to revise existing data and collect new data in a computer friendly format. The High Dimensional Phenotyping group has prototypes ready for two example use cases, dealing with near infrared spectra data and metabolomics data. These datasets are still very experimental, but the goal is to make a repeatable pattern that can be used for many other matrix style datasets as crop breeding data grows more complex.  </p><p class=\"news-post-paragraph\">Looking further into the future of BrAPI, there were a couple of deep discussions about generalized analytics, and several groups working on GraphQL type systems. Generalized analytics is a topic that comes up regularly in the BrAPI community, but it is a difficult problem to solve. Users want to be able to save and retrieve data that has been analyzed, sometimes as secondary observations, sometimes as averages or filters, and sometimes as downstream predictions or recommendations. The difficulty is finding the balance between generalization and specification so that the data is useful, but the specification is scalable. The discussions during the hackathons mostly focused on brainstorming the different types of analytical systems BrAPI should be compatible with, and the main conclusion is we need a more focused working group to dig into this problem over a longer period.   </p><p class=\"news-post-paragraph\">GraphQL is a different type of web service API, similar to REST, but with a more intricate and complex querying system. During the hackathon, there were three different groups working on GraphQL related projects, with the intent to convert the BrAPI data model from REST to GraphQL. This high level of interest indicates that this is a technology to be addressed and standardized across the community. A proposal was made during the hackathon to create a new community working group to focus on GraphQL as an alternate standard.   </p><p class=\"news-post-paragraph\">Keep watching the BrAPI Update emails and the Slack channel for announcements about these new working groups if you are interested in data analytics or GraphQL.   </p>    <p class=\"news-post-links\">  <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-apr-2022#notes-section\">Virtual Hackathon Notes and Recordings</a>  </p>    <h4 class=\"news-post-header\">Future Hackathon Volunteers</h4>  <p class=\"news-post-paragraph\">As the COVID-19 pandemic slows down and global travel is becoming safer, it is time to start thinking about in-person hackathons again. In-person hackathons are a very important part of the BrAPI community. Virtual hackathons allowed us to survive the pandemic, but in-person events make the community thrive. Meeting in person prompts more collaborative discussions and allows us to build stronger international partnerships. Personally, I miss hearing the low hum of conversation as a room full of focused developers help each other solve problems.     </p><p class=\"news-post-paragraph\">The current plan is to have one more virtual hackathon in October 2022, and then April 2023 will be in-person. I am formally asking for volunteers to host the April 2023 hackathon. Host organizations get the opportunity to bring this diverse community to your city, show off your facilities and culture, while having a productive week with a room full of BrAPI experts. I personally work with the hosts to plan and organize a successful event. There is a certain amount of extra responsibility and work to be done as a host, but it is always worth it. If you would like to volunteer your organization as a BrAPI hackathon host, or if you'd like to hear more information before volunteering, please contact me <a href=\"mailto:brapicoordinatorselby@gmail.com\"> brapicoordinatorselby@gmail.com</a>  </p>    <h4 class=\"news-post-header\">Community Spotlight – BrAPI Interactive ERD</h4>  <p class=\"news-post-paragraph\">For this update, I would like to shine the spotlight on some of my own work. During the April 2022 hackathon, I began work on a simple Entity Relationship Diagram for the primary data models in the BrAPI spec. I continued this work after the hackathon, and I can now officially release the first iteration of the BrAPI Interactive ERD. This tool is designed to help visualize and understand the full BrAPI data model. It can also be paired with the first version of the BrAPI Term Browser, built by Marie-Angélique Laporte and Valentin Guignon. These tools combine to offer a more holistic picture of BrAPI, without relying on the RESTful web service documentation. This is a first step towards the goal of defining BrAPI as an independent data model. You can view this project in its temporary home on Github pages now, but it will be eventually moved to a more prominent place on brapi.org. Please feel free to give feedback and report issues on Github.  </p>    <p class=\"news-post-links\">  <a target=\"_blank\" href=\"https://plantbreeding.github.io/brapi-ontology/uml.html \"> BrAPI Interactive ERD </a>  <br><a  target=\"_blank\" href=\"https://plantbreeding.github.io/brapi-ontology/combo_browser.html \"> Combined ERD and Term Browser </a>  <br><a  target=\"_blank\" href=\"https://github.com/plantbreeding/brapi-ontology/issues \"> Github Repository </a>  </p>    <h4 class=\"news-post-header\">Request for Comments</h4>  <p class=\"news-post-paragraph\">Please review the following issues on GitHub. If the issue has an impact on your work, please consider leaving a comment on the issue. This could be a clarifying question, some constructive criticism, or simply a \"thumbs-up\" emoji to show you approve of the proposed change. Any feedback from the community helps to prioritize issues for future releases of the BrAPI Spec.  </p>    <p class=\"news-post-links\">  <a target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/issues/545\"> #545 – shawnyarnes - Make inventory more generic and species agnostic </a>  <br><a  target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/issues/495\"> #495 – GuilhemSempere - Listing databases and having some kind of placeholder for them in the endpoint </a>  <br><a  target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/issues/550\"> #550 – chaneylc - Remove max limit on plate dimensions </a>  </p>"
    },
    "mar-14-2022": {
        "ISO8601": "2022-03-14",
        "title": "Hackathon - March 2022 Virtual - Announcement",
        "date": "March 14, 2022",
        "author": "Peter Selby",
        "article": "<h4>Mark Your Calendar! The next BrAPI Virtual Hackathon will be April 25 – April 29, 2022! <br/>  <a target=\"_blank\" href=\"https://forms.gle/YhfyQphw75u8BuJu9\" style=\"text-decoration: underline;\">Register Here!</a> Agenda and other details are coming soon. </h4>  <h4>Overview</h4>  <p style=\"margin-left: 15px;\">The BrAPI Community Hackathon is an event focused on bringing together the BrAPI community. This week-long event will reserve time for the members of the community to discuss the BrAPI specification, collaborate on projects, socialize and learn from each other. The hackathon is largely self-organizing project work time, with a few scheduled public discussion sessions addressing important community topics. The overall goal is to be as productive as possible in a small window of time, to explore ideas and start on collaborative projects that can be more formally developed after the event. </p>  <p style=\"margin-left: 15px;\">Due to the COVID-19 pandemic, it is not possible to bring everyone together in person, so the BrAPI Hackathons have gone virtual. Based on the feedback from previous events, the ideal plan would be a mix of virtual and in-person events, when international travel becomes possible again. For now, expect virtual BrAPI hackathons every 6 months to maintain momentum and growth of the community.  </p>  <h4>Get Prepared</h4>  <p style=\"margin-left: 15px;\">Start thinking about projects and planning collaborative groups now. Your project can be anything related to BrAPI. Add BrAPI to an existing tool or server, develop a new BrAPP idea, create an automated connection with another tool/group, work on a BrAPI development assistance tool/library, or design a new BrAPI concept/interface. On the last day of the hackathon, there will be an opportunity to present what your group has accomplished, so be prepared to show progress by the end of the week. If you do not have a project idea, that is ok too. There will be a list of general community projects available for anyone to work on. There are many different ways to contribute! </p>  <p style=\"margin-left: 15px;\">One major take away from previous virtual hackathons was that attendees were feeling distracted by other work. If you can, try to reserve the whole week in your schedule so normal work does not intrude on the project work time. Of course, deadlines and emergencies happen, and BrAPI will not always be the top priority. This is just a reminder that you will get more out of the virtual hackathon experience if you can dedicate the time to focus on it. </p>  <p style=\"margin-left: 15px;\"><a target=\"_blank\" href=\"https://forms.gle/YhfyQphw75u8BuJu9\">Register Here! </a> Agenda and other details are coming soon. Look for more announcements on the <a target=\"_blank\" href=\"https://brapi.org/contact\">mailing list, <a target=\"_blank\" href=\"https://plantbreedingapi.slack.com\">Slack channel</a>, and <a target=\"_blank\" href=\"https://twitter.com/breedingapi\">Twitter</a>. Feel free to forward this message on to other interested groups and communities. </p>"
    },
    "nov-11-2021": {
        "ISO8601": "2021-11-11",
        "title": "BrAPI Update – November 2021",
        "date": "November 11, 2021",
        "author": "Peter Selby",
        "article": " <h4>Hackathon Debrief</h4> <p> Thank you to everyone who participated in the latest virtual BrAPI hackathon. I am glad so many people from around the world are still able to come together and collaborate, even if we cannot meet in person. We had 61 registered attendees from 28 different organizations, and a full agenda of hacking and community discussions. I encourage everyone to explore the meeting notes and session recordings by going to the <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2021#notes-section\">hackathon web page</a>. There is too much content to cover everything in this newsletter, so here are a few highlights from the event. </p><ul> <li style=\"margin-bottom: 10px;\">A long-standing tradition for the BrAPI hackathon is the presentation of Community Updates. On the first day of the hackathon, groups had the opportunity to introduce themselves and their work to the rest of the community. An interesting trend emerged this year with a large percentage of the groups working on collaborative work. There was a mix of direct collaboration between groups, and development of general applications, compatible with any BrAPI data source. To me, this indicates a rising level of maturity for the BrAPI project and community.</li> <li style=\"margin-bottom: 10px;\">In addition to the standard \"BrAPI 101\" class, this hackathon also boasted some additional sessions to review how things work in the BrAPI project. First was the BrAPI Infrastructure discussion, which provided an overview of ALL the digital resources associated with the BrAPI project. This discussion also touched on upcoming tools and resources that will become available to the community. Next was the Authentication discussion, to review BrAPI's role with authentication and provide some examples of best practices. It is not BrAPI's place to mandate or enforce any particular authentication technology, but it is useful to have some examples available for the community. </li> <li>Near the end of the week, the BrAPI v2.1 discussion took place. This discussion provided an opportunity for everyone in the community to make their voices heard as we discussed the scope and schedule of the next version of the standard. There was a lot of debate and compromise during these talks, and even though we did not have a chance to touch on every detail, we were able to set a reasonable scope for BrAPI v2.1.</li> </ul><h4>Working Groups</h4><p> One of the many results to come out of the hackathon was the official formation of the BrAPI community working groups. While the concept of working groups is well known to many of us, these groups are new for the BrAPI community. I expect it will take a little time to find a working model that fits this community, but I am confident that working groups can become a regular and effective part of the BrAPI development process. <br>We currently have three active working groups, described below. If any of these groups sounds interesting, please <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact me</a> to join the conversation. Every group can benefit from additional subject matter experts and more practical use cases to solve with the standard.</p><ul> <li style=\"margin-bottom: 10px;\"> <strong>Genotype Performance Working Group </strong> - Meets every other Tuesday (Nov 2nd, 16th, 30th, etc) <br>This group is concerned with making improvements to the BrAPI-Genotyping specification. Right now they are focused on a critical performance issue in the \"GET /calls\" endpoint. The current response structure is too inefficient to be used effectively, so the group is working on condensing and simplifying it. Three similar proposals have already been presented for consideration, and the group will be discussing how to merge them into something useful and usable for everyone involved. </li> <li style=\"margin-bottom: 10px;\"> <strong>BrAPI Agronomy Working Group</strong> - Meets every other Wednesday (Nov 3rd, 17th, Dec 1st, etc) <br>Although this group is named BrAPI Agronomy, they will be looking at both the agronomy and crop modeling domains, since there are a lot of overlapping concepts. The goal of this group is to expand the BrAPI specification to make it usable for agronomy and crop modeling use cases. BrAPI already has many of the concepts needed for these domains, but it needs enhancements in areas like events, treatments, weather data, and soil data. They have compiled and prioritized a list of concepts to be expanded, and will work through the list to define better data structures. </li> <li> <strong>High Dimensional Phenotyping Working Group</strong> - Meeting times to be determined based on interest <br>Traditional phenotypes can be represented as a single value per observation unit per observation variable per timestamp. This group is interested in being able to represent phenotypic data that does not fit as a traditional, scalar value. There are a number of emerging technologies which need to represent each observation as an array, such as NIRS, Metabolomics, Transcriptomics, and Histogram data. The group has started with NIRS data as an example use case, and eventually it will be generalized to fit other types of high dimensional data. </li></ul> <h4>BrAPI v2.1</h4><p> BrAPI v2.1 is coming soon! During the hackathon we had multiple sessions dedicated to narrowing the scope of v2.1 to an acceptable size. With every update to the specification, it is important to find a balance between a stable standard and allowing for change and growth. The current scope for v2.1 includes 45 issues from <a target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/projects/6\">GitHub</a>. A majority of these issues are small changes to individual data fields or parameters. As this is a minor version update, all changes will be backward compatible with v2.0, and there is no requirement to upgrade. The new specification document is available now as a developer preview on <a target=\"_blank\" href=\"https://brapi.org/specification\">brapi.org</a>, and will be updated as each issue is resolved. As always, feel free to <a href=\"mailto:brapicoordinatorselby@gmail.com\">contact me</a> with any comments, questions, and concerns.</p><p style=\"margin: -10px 0 20px 30px;\"> <a target=\"_blank\" href=\"https://github.com/plantbreeding/BrAPI/projects/6\"> BrAPI v2.1 Issues Board </a> <br> <a target=\"_blank\" href=\"https://brapi.org/specification\"> BrAPI v2.1 Developer Preview </a> <br> <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2021#notes-section\"> BrAPI v2.1 Hackathon Discussions</a></p>"
    },
    "sep-02-2021": {
        "ISO8601": "2021-09-02",
        "title": "Hackathon - October 2021 Virtual - Update",
        "date": "September 02, 2021",
        "author": "Peter Selby",
        "article": "<p> We are only a month from the next BrAPI Virtual Hackathon! Please remember to <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2021\"> REGISTER </a> if you have not already. The hackathon is free to attend for everyone, but registered attendees will be sent announcements, schedule updates, and meeting links directly. </p><p> The <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2021\"> hackathon web page </a> is now up, with all the details you need to stay informed about the hackathon. Go to <a target=\"_blank\" href=\"https://brapi.org/events/hackathon-oct-2021\"> brapi.org/events/hackathon-oct-2021 </a> to check it out, and please check this page regularly as it is subject to change without warning. On this page, you can find the following:<ul><li> An <a target=\"_blank\" href=\" https://brapi.org/events/hackathon-oct-2021#overview-section \"> Overview </a> of the hackathon, and a link to register. This includes a lot of the same information included in the hackathon announcement email. </li><li> The hackathon <a target=\"_blank\" href=\" https://brapi.org/events/hackathon-oct-2021#agenda-section \"> Agenda </a> of public discussion topics. The agenda is broken into two duplicate sessions, eight hours apart, to try to accommodate as many time zones as possible. The agenda outlines the major community discussion topics, but all attendees are encouraged to reserve the whole week for the hackathon. The goal is to divide time evenly between general community discussions, and project work time. The BrAPI hackathon can be both a venue of communication and a productive technical work environment. </li><li> The public <a target=\"_blank\" href=\" https://brapi.org/events/hackathon-oct-2021#attendees-section \"> Attendees List </a> is something new to this hackathon. This should keep everyone informed on who is planning to attend and which organizations will be represented. Knowing ahead of time who will be attending can be very useful for planning projects and knowing what can be accomplished in a short week. During registration, there is an option not to be included publicly on this list if desired. </li><li> The list of <a target=\"_blank\" href=\" https://brapi.org/events/hackathon-oct-2021#projects-section \"> Projects List </a> presents all the project ideas attendees will be working on during the hackathon. This can provide ideas to other groups, or provide collaboration opportunities for participants looking for a project to work on. </li><li> Finally, the <a target=\"_blank\" href=\" https://brapi.org/events/hackathon-oct-2021#notes-section \"> Notes and Recordings </a> section is currently empty, but it will become populated with the outcomes of each discussion on the agenda. Hopefully, this will prove useful for people who are unable to attend, or as a reference to look back on discussions and community decisions that were made. </li></ul></p>"
    },
    "aug-16-2021": {
        "ISO8601": "2021-08-16",
        "title": "Hackathon - October 2021 Virtual - Announcement ",
        "date": "August 16, 2021",
        "author": "Peter Selby",
        "article": "<h4>Mark Your Calendar! The next BrAPI Virtual Hackathon will be Oct 4 – Oct 8, 2021! <br/><a target=\"_blank\" href=\" https://docs.google.com/forms/d/e/1FAIpQLScH8L3M_0r7uqi1rvjWe7EJn01VC5DFg6tFv4x33YbZxIvcWw/viewform?usp=sf_link\" style=\"text-decoration: underline;\">Register Here!</a> Agenda and other details are coming soon. </h4><h4>Overview</h4><p style=\"margin-left: 15px;\">The BrAPI Community Hackathon is an event focused on bringing together the BrAPI community. This weeklong event will reserve time for the members of the community to discuss the BrAPI specification, collaborate on projects, socialize and learn from each other. The hackathon is largely self-organizing project work time, with a few scheduled public discussion sessions addressing important community topics. The overall goal is to be as productive as possible in a small window of time, to explore ideas and start on collaborative projects that can be more formally developed after the event. </p><p style=\"margin-left: 15px;\">Due to the COVID-19 pandemic, it is not possible to bring everyone together in person, so the BrAPI Hackathons have gone virtual. Based on the feedback from the first virtual hackathon in March, the ideal plan would be a mix of virtual and in-person events, when international travel becomes possible again. For now, expect virtual BrAPI hackathons every 6 months to maintain momentum and growth of the community.  </p><h4>Get Prepared</h4><p style=\"margin-left: 15px;\">Start thinking about projects and planning collaborative groups now. Your project can be anything related to BrAPI. Add BrAPI to an existing tool or server, develop a new BrAPP idea, create an automated connection with another tool/group, work on a BrAPI development assistance tool/library, or design a new BrAPI concept/interface. On the last day of the hackathon, there will be an opportunity to present what your group has accomplished, so be prepared to show progress by the end of the week. If you do not have a project idea, that is ok too. There will be a list of general community projects available for anyone to work on. There are many different ways to contribute! </p><p style=\"margin-left: 15px;\">One major take away from the last virtual hackathon was that attendees were feeling distracted by other work. If you can, try to reserve the whole week in your schedule so normal work does not intrude on the project work time. Of course, deadlines and emergencies happen, and BrAPI will not always be the top priority. This is just a reminder that you will get more out of the virtual hackathon experience if you can dedicate the time to focus on it. </p><p style=\"margin-left: 15px;\"><a target=\"_blank\" href=\"https://docs.google.com/forms/d/e/1FAIpQLScH8L3M_0r7uqi1rvjWe7EJn01VC5DFg6tFv4x33YbZxIvcWw/viewform?usp=sf_link\">Register Here! </a> Agenda and other details are coming soon. Look for more announcements on the <a target=\"_blank\" href=\"https://brapi.org/contact\">mailing list, <a target=\"_blank\" href=\"https://plantbreedingapi.slack.com\">Slack channel</a>, and <a target=\"_blank\" href=\"https://twitter.com/breedingapi\">Twitter</a>. Feel free to forward this message on to other interested groups and communities. </p>"
    },
    "jul-08-2021": {
        "ISO8601": "2021-07-08",
        "title": "BrAPI Update - July 2021",
        "date": "July 08, 2021",
        "author": "Peter Selby",
        "article": "<h4>Hello BrAPI Community, </h4><p style=\"margin-left: 15px;\">My focus of the past two month has been the new grant proposal to keep the BrAPI project going. With a lot of assistance from Kelly Robbins and Lukas Mueller, I am happy to say that the proposal is finally taking shape. Unsurprisingly, the primary objective of the proposal is to keep doing what we are already doing: enhance and expand the specification and grow the community. A major theme throughout the proposal is long-term sustainability of the project. With a little luck, we plan to take the next few years to formalize the governance and funding model for the BrAPI project to give it the best possible chance of surviving long term. As always, if you have any ideas, comments, or questions, please feel free to contact me. </p><h4>Upcoming (virtual) events </h4><p style=\"margin-left: 15px;\">The Bioinformatics Open Source Conference (BOSC) will be July 29-30. I will be giving a short talk about BrAPI as a standard and as a community, followed by a short Q&A session. My talk has been pre-recorded, with a YouTube link below if you can't make it to the conference. It is nothing particularly interesting or new for this community, but a good five minute introduction to BrAPI. </p><p style=\"margin: -10px 0 20px 30px;\"><a target=\"_blank\" href=\"https://www.open-bio.org/events/bosc-2021/\"> BOSC 2021 </a> <br/><a target=\"_blank\" href=\"https://youtu.be/f1G9HYY_onU\"> BrAPI Presentation</a></p><h4>Community Spotlight – FAIDARE</h4><p style=\"margin-left: 15px;\">This month, we shine the spotlight on the <a target=\"_blank\" href=\"https://urgi.versailles.inrae.fr/faidare/\">FAIDARE</a> project, or the FAIr Data-finder for Agronomic REsearch. FAIDARE is a generic search engine for crop sciences data discovery, developed by <a target=\"_blank\" href=\"https://urgi.versailles.inrae.fr/\">URGI INRAE</a>. The project began in 2013 as a simple search tool for the <a target=\"_blank\" href=\"https://urgi.versailles.inrae.fr/wheatis/\">WheatIS project</a>. This initial iteration was very active and successful, but it lacked standardization, which made it difficult to add new data sources. In 2017, the team began building the FAIDARE project as a stand-alone tool, with BrAPI and <a target=\"_blank\" href=\"https://www.miappe.org/\">MIAPPE</a> as the data collection and index standards. This created a data discovery network of federated, BrAPI compatible, data sources. A user can search for the names and identifiers of traits, germplasm, phenotyping studies, and genotyping studies, with a variety of useful filters to refine the results. In the background, FAIDARE uses BrAPI to collect metadata from all of the registered data sources. Then, the harvested metadata is indexed and queried using <a target=\"_blank\" href=\"https://www.elastic.co/what-is/elasticsearch/\">ElasticSearch</a>. This provides the user with enough information to find the data they are looking for, and provides a link back to its original source database. <br/>The project is still being actively maintained, and they are actively looking for BrAPI compatible data sources to join the federation. The team plans to add many more data sources, along with improvements to the full text search and fine grained criteria filters. Keep an eye on the GitHub for many of these changes coming soon. I encourage everyone to explore this tool, and consider joining the community with your BrAPI compatible database. </p><p style=\"margin: -10px 0 20px 30px;\"><a target=\"_blank\" href=\"https://urgi.versailles.inrae.fr/faidare/\">FAIDARE</a><br/><a target=\"_blank\" href=\"https://urgi.versailles.inra.fr/faidare/join\">How to join the federation</a><br/><a target=\"_blank\" href=\"https://github.com/elixir-europe/plant-brapi-etl-faidare\"> Github</a></p><h4>Request for Comments</h4><p style=\"margin-left: 15px;\">Please review the following issues on GitHub. If the issue has an impact on your work, please consider leaving a comment on the issue. This could be a clarifying question, some constructive criticism, or simply a \"thumbs-up\" emoji to show you approve of the proposed change. Any feedback from the community helps to prioritize issues for future releases of the BrAPI Spec. </p><p style=\"margin: -10px 0 20px 30px;\"><a target=\"_blank\" href=\"https://github.com/plantbreeding/API/issues/392\"> #392 – nickpalladino – Allow observations to be deleted</a><br/><a target=\"_blank\" href=\"https://github.com/plantbreeding/API/issues/465\"> #465 – guypfr – Add additional CLONAL Parent type for progeny</a><br/><a target=\"_blank\" href=\"https://github.com/plantbreeding/API/issues/457\"> #457 – lukasmueller – Standardize service for image analysis</a></p>"
    },
    "may-04-2021": {
        "ISO8601": "2021-05-04",
        "title": "BrAPI Update - May 2021",
        "date": "May 04, 2021",
        "author": "Peter Selby",
        "article": "<p>During the recent BrAPI Virtual Hackathon, there were a few ideas floating around for how to passively increase community engagement throughout the year, instead of trying to squeeze everything into a single community event. I will begin implementing two of these ideas monthly starting now. Each month, expect to see a \"Community Spotlight\" and a \"Request for Comments\". The \"Community Spotlight\" is intended to highlight one interesting tool/app/server in the community. If you would like to volunteer a project to be advertised to the rest of the community in this way, please reach out to me. The \"Request for Comments\" is intended to highlight 2-3 issues on the BrAPI GitHub issues board. The goal is to show support, start discussions, and help prioritize future changes in the BrAPI spec. </p><h4>Community Spotlight – BrAPI Wiki</h4><p>The BrAPI Wiki is an open platform for expanded documentation, going beyond the core, technical documentation of the BrAPI Specification. The wiki has over 50 articles of documentation right now. Some of these articles act as a historical record of documents generated by the community. These include things like past meeting notes, concept diagrams, and proposed use cases from the very early days of the project. Some articles are focused on the current BrAPI community. These pages outline things like development best practices and implementation notes. <br/>Anyone in the BrAPI community can edit articles in the BrAPI Wiki. It is easy and secure to login using GitHub credentials. There is an almost constant need to write new content and maintain the existing documents. If you are looking for an easy way to contribute to the BrAPI community, please consider editing and improving the BrAPI Wiki. Visit <a target=\"_blank\" href=\"https://wiki.brapi.org\"> wiki.brapi.org</a> to start browsing and editing the BrAPI Wiki. </p><h4>Request for Comments</h4><p>Please review the following issues on GitHub. If the issue has an impact on your work, please consider leaving a comment on the issue. This could be a clarifying question, some constructive criticism, or simply a \"thumbs-up\" emoji to show you approve of the proposed change. Any feedback from the community helps to prioritize issues for future releases of the BrAPI Spec. </p><p><a target=\"_blank\" href=\"https://github.com/plantbreeding/API/issues/468\"> #468 – NPZInno – Adjusted entry mean </a><br/><a target=\"_blank\" href=\"https://github.com/plantbreeding/API/issues/461\"> #461 – chaneylc – Add various crosses endpoints </a><br/><a target=\"_blank\" href=\"https://github.com/plantbreeding/API/issues/454\"> #454 – GuilhemSempere – Managing multiple assemblies </a><br/></p>"
    },
    "apr-08-2021": {
        "ISO8601": "2021-04-08",
        "title": "Hackathon - March 2021 Virtual - Wrap-up",
        "date": "April 08, 2021",
        "author": "Peter Selby",
        "article": "<h4>Virtual BrAPI Hackathon Debrief </h4><p>On March 19, we concluded the first ever BrAPI Community Virtual Hackathon. I believe overall, the event went well, and it was certainly a learning experience for the community and myself. Scheduling was a particular challenge with attendees from eight different time zones spread around the world. Instead of the usual, concentrated week of hacking, we decided to spread the event over two weeks with two smaller sessions per day. I wanted to take the opportunity to highlight some of the projects and discussions that occurred, but I cannot cover everything. Every formal discussion was recorded and meeting notes were created for the discussions and projects. I would like to encourage everyone to go to the <a href=\"https://brapi.org/events/hackathon-mar-2021\">Event Page</a> to check out all the recordings and documentation generated from the hackathon. In particular, I recommend watching the recordings for \"Community Updates\" and \"Project Presentations\" to get an overview of what the community is currently working on.</p><h4>Next BrAPI Version</h4><p>During the \"Next BrAPI Version\" discussion, the groups came to a consensus that the next iteration of the BrAPI spec will be a minor version v2.1. This means complete backward compatibility with v2.0 with mostly minor additions and enhancements. A large majority of the current BrAPI GitHub issues are focused around additional fields and endpoints to increase the functionality of the API. There is also significant interest in the community around additional modules for Analytics and Agronomy. One or both of these modules may be included in the v2.1 update, depending on time and readiness of the module. Again, this would all be additional functionality, no impact to existing v2.0 functionality. Check out the <a href=\"https://docs.google.com/document/d/1MsE8IcvVE_INFnfajyQ6-_9itcJ4n-aYpQVNwhmDV-w\">Meeting Notes</a> for an outline of the formal release process, as well as a few specific enhancements we discussed. </p><h4>BrAPI Data Networks</h4><p>We had some very interesting discussions I wanted to highlight around the idea of BrAPI data networks. The primary goal of the BrAPI project is to make interoperability between systems easier, and there is no better use case than being able to construct a distributed data source from a network of BrAPI compliant repositories. We talked about several examples of different flavors of networks being built in the community right now. <br/>The new BrAPP <a href=\"https://github.com/IntegratedBreedingPlatform/brapi-sync\">BrAPI-Sync</a>, from IBP, provides a simple UI for sharing and synchronizing Germplasm data between systems. Any system that implements the correct BrAPI endpoints and provides this UI become part of a distributed network, able to freely exchange Germplasm metadata. <br/>A collaborative group from the Universities of Florida, Georgia, and Arizona have come together on the ARDN project <a href=\"https://datascience.cals.arizona.edu/news/2020/06/hackathon-building-agricultural-research-data-network\">the ARDN project</a>. Their goal is to bring data together from a network of data sources and meaningfully combine it in the Ag Data Commons central repository. BrAPI compatible systems can easily provide data to be collected by this system, where it can be searched and combined with other sources in the network to glean new insight. <br/>The <a href=\"https://urgi.versailles.inrae.fr/faidare\">FAIR Data-finder for Agronomic Research (FAIDARE)</a> project, built by INRAE, is a generic, plain text, search engine for any BrAPI compatible resources. During the discussion, the group agreed that we should strive to make FAIDARE the official BrAPI community search engine. They currently have eight registered data sources, with several more sources in the processes of being indexed and added. I encourage everyone to check out FAIDARE and consider <a href=\"https://urgi.versailles.inrae.fr/faidare/join\">joining this search and discovery network</a>. </p><h4>BrAPI Data Model</h4><p>A theme that came up a few times during the hackathon was the idea of separating the BrAPI data model from the RESTful specification. BrAPI was conceived and built as a RESTful web service specification, but now it seems the needs of the community are beginning to expand. A team began building the <a href=\"https://plantbreeding.github.io/brapi-ontology\">BrAPI Term Browser</a> as a tool for rigorously defining and viewing the BrAPI data model, without the context of REST. There were discussions around alternative querying structures using the raw BrAPI data model with tools like ElasticSearch and GraphQL. I fully support this independence of the BrAPI data model and growth into other types of systems and use cases. </p><p>There are too many discussions and projects for me to mention them all in this report. Please go to the <a href=\"https://brapi.org/events/hackathon-mar-2021\">Event Page</a> to review the full project list and all the discussion recordings. In particular, take a look at the Community Update <a href=\"https://youtu.be/I9-demtfEuk\">Session #1</a> and <a href=\"https://youtu.be/Td0bzyTyFg8\">Session #2</a> for general updates from the community, and take a look at the Project Presentations <a href=\"https://youtu.be/tYkJ0uB9Uv8\">Session #1</a> and <a href=\"https://youtu.be/7X0AbmMSPx0\">Session #2</a> to celebrate what was accomplished by the project teams.  </p>"
    },
    "feb-17-2021": {
        "ISO8601": "2021-02-17",
        "title": "Hackathon - March 2021 Virtual - Announcement",
        "date": "February 17, 2021",
        "author": "Peter Selby",
        "article": "<p>Registration is now open for the BrAPI Virtual Hackathon 2021!</p><p><a class= \"btn btn-d btn-round \" target= \"_blank \" href= \"https://forms.gle/46UkpnS5c9eSYxbDA \">Register Now</a></p><p>This event will take place across two weeks: March 8 – 19, 2021. There will be two sessions per day to accommodate many different time zones. <ul> <li> Session #1: every day from 08:00 UTC to 11:00 UTC <a target= \"_blank \" href= \"https://www.google.com/search?q=08%3A00+UTC \"> (Click for local time) </a> for Europe, Africa, and Asia. </li> <li> Session #2: every day from 16:00 UTC to 19:00 UTC <a target= \"_blank \" href= \"https://www.google.com/search?q=16%3A00+UTC \"> (Click for local time) </a> for the Americas, Europe and Africa.</li> </ul> </p><p>Please check the <a target= \"_blank \" href= \"https://brapi.org/events/hackathon-mar-2021 \"> Event Info Page </a> for the latest information. </p>"
    },
    "feb-02-2021": {
        "ISO8601": "2021-02-02",
        "title": "BrAPI Update - February 2021",
        "date": "February 02, 2021",
        "author": "Peter Selby",
        "article": "<h4>BrAPI Virtual Hackathon</h4><p>Mark Your Calendars! I am pleased to announce that the BrAPI Virtual Hackathon will be March 8-19, 2021. Please watch your <a target=\"_blank\" href=\" /contact\">Email</a>, <a target=\"_blank\"href=\"https://join.slack.com/t/plantbreedingapi/shared_invite/enQtNjA4NTA3OTI5NjUxLWE5ZmI0NDE0NGM1ODkxMjVmMDU1MGVjY2Q5M2QxNGNkYzMyODhkNDVmZjM0ZGI1YzEwYjEwNmY0MDM1YjllZDU\">Slack</a>, and <a target=\"_blank\" href=\"https://twitter.com/breedingapi\">Twitter</a> for more information about registration and agenda coming soon. Thank you to everyone who completed the survey. The general plan is to stretch a normal BrAPI Hackathon over two weeks instead of one. This will relax the schedule for each day and allow for more flexibility with time zones. From the survey results, the top three focus points will be 1) Project updates from the community; 2) Focused discussions improving the BrAPI spec; and 3) Dedicated project work time.  I encourage everyone to take a little time to prep a short update and be ready with some BrAPI related projects to share and work on. </p><h4>Server and DNS updates</h4><p>This week, I am doing some maintenance to the brapi.org infrastructure. Thanks to all those who reached out to me on Monday about the DNS error, that error should be resolved now. You might see some other service interruptions as I get everything settled into its new home (as I write this, the BrAPI Wiki site is still down). There should not be any visible changes to the site, but the change in infrastructure will make things much easier for me to manage in the background. This marks a step toward BrAPI becoming more independent and sustainable, so please forgive the bumps along the way. </p>"
    },
    "jan-04-2021": {
        "ISO8601": "2021-01-04",
        "title": "Community Announcement – Virtual Hackathon Survey",
        "date": "January 04, 2021",
        "author": "Peter Selby",
        "article": "<h4>Happy New Year,</h4> <p>Good news: We are finally organizing a BrAPI Virtual Hackathon! <br/> Bad news: With virtual meetings across almost every time zone, this hackathon is going to be organized chaos. </p> <p>I would like to start with a survey. This survey is intended to find out who is interested, what dates/times people are available, and how we are going to structure the agenda. I am trying to find out what things to focus on during the event and  how many different people, organizations, and time zones we are dealing with. This survey is NOT a commitment to attend. There will be a more normal registration form once we have a date and rough agenda.</p> <p>Please take a few minutes to fill it out as soon as possible. Also, please feel free to forward this on to anyone else who might be interested. The more data I have, the better I can plan.</p> <p><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://docs.google.com/forms/d/e/1FAIpQLSft_0h81oE96s_8GgXXz8J5K7mikdajBwNroB6J4zUnkFJW0w/viewform?usp=sf_link\">Virtual Hackathon Survey</a></p>"
    },
    "oct-10-2020": {
        "ISO8601": "2020-10-10",
        "title": "BrAPI Update - October 2020",
        "date": "October 10, 2020",
        "author": "Peter Selby",
        "article": "<h4>Hello BrAPI Community, </h4> <p>It has been six, very long, interesting, months since the last BrAPI update. I hope you are all happy, healthy, and safe. During the summer, my primary focus has been to improve the BrAPI website. I encourage everyone to go check out some of the new stuff on brapi.org and if you have any ideas for improvement, please let me know. </p> <h4>Contact and Twitter</h4> <p>There is a new <a href=\"https://brapi.org/contact\">Contact</a> page on the site. Here you can find the standard links for my public email and the BrAPI Slack channel. I have added a form to subscribe to the BrAPI mailing list, or <a href=\"https://brapi.org/unsubscribe\">unsubscribe</a>  yourself if needed. Email, Slack, and the GitHub Issues board are still the best ways to contact me if you have any questions/comments, or if you just want to say hi. </p> <p>Also listed on the <a href=\"https://brapi.org/contact\">Contact</a> page, I’m excited to announce BrAPI is now on Twitter! Follow <a target=\"_blank\" href=\"https://twitter.com/breedingapi\"> @breedingapi</a> for community project updates and other BrAPI related random thoughts. I’m looking for suggestions of interesting accounts to follow, and I’m happy to tweet or retweet on behalf of anyone in the BrAPI community. </p> <h4>Get Started</h4> <p>The new <a href=\"https://brapi.org/get-started\">Get Started</a> page is a short set of documentation I put together to help new community members who are trying to figure out what BrAPI is and how to use it. It answers many of the questions I am asked regularly, combined with some of the material I usually present in the BrAPI 101 class. I have also included links to some external resources where applicable, including the BrAPI 101 slide deck. I hope this will further reduce the cost of entry and allow more groups to start using BrAPI successfully. In the future, I hope to expand this to include a short interactive development exercise to give people a better idea what a real BrAPI Client and Server might look like. Even if you are a veteran in the BrAPI community, I encourage you to go read through the pages. Please let me know if you feel I have missed any important points or need to add clarification. </p> <h4>Server List</h4> <p>The new <a href=\"https://brapi.org/servers\">Servers</a> page displays a list of registered BrAPI servers within the community. The JSON list of servers has historically lived in the BrAPI GitHub repo, but it has now moved and been integrated with brapi.org. Everything is grouped by organization with available text descriptions for each server and tags for quickly identifying things like authentication and BrAPI version. There is also a <a href=\"https://brapi.org/servers/submit\">Registration Form</a> for submitting new servers to the list. Everything submitted through that form is held for review before posting publicly, so updates might not appear right away. </p> <p>I encourage everyone to go look at the list! If you have servers already listed, please double check the information is correct and complete. If you do not have a server listed, please consider registering it as a way to advertise everything available in this community and encourage collaboration. </p>"
    },
    "apr-28-2020": {
        "ISO8601": "2020-04-28",
        "title": "BrAPI Update - April 2020",
        "date": "April 28, 2020",
        "author": "Peter Selby",
        "article": "<h4>Hello BrAPI Community</h4><p>I hope this update finds you all safe, healthy, and comfortably working at home during these interesting times we live in. To contrast all the negative news stories floating around these days, I have a few positive developments to share that I’m excited about.</p><h4>BRAVA and the Test Server</h4><p>I’m happy to report that both the <a href=\"http://webapps.ipk-gatersleben.de/brapivalidator\">BRAVA testing tool</a> and the official <a href=\"https://test-server.brapi.org/brapi/v2/serverinfo\">BrAPI Test Server</a> have been successfully upgraded to BrAPI V2.0. BRAVA needs a little bit more time before the updates are available on the public server, but you can access the upgraded version from <a href=\"https://github.com/plantbreeding/IPK-BrAPI-Validator\">Github</a> if you are very eager to set up your own testing client application. The official BrAPI Test Server is deployed publicly <a href=\"https://test-server.brapi.org/brapi/v2/serverinfo\">HERE</a>, with a minimalist dummy data set. Over the next few weeks, I’ll be working on expanding the dummy data set and fixing bugs. If you find any problems with either of these tools, as always please reach out to me and/or open an issue in the appropriate Github page. </p><h4>BrAPI V2.0 Patch</h4><p>While implementing the official BrAPI V2.0 Test Server, I found several critical issues with the specification document. Many of these things broke general BrAPI rules (for example, every BrAPI object must have 'additionalInfo'), or they just did not make logical sense (for example, a 'page' parameter when pagination is not allowed). Because of this, I have organized a semi-formal patch to the BrAPI V2.0 documentation. These changes are meant to clarify the documentation only. They are not meant to change any implementation in any meaningful way. In fact, when I was speaking to someone who has already started working on a V2 implementation, they had fixed most of these things in their implementation without realizing it. If you have done any work with BrAPI V2.0, please review the list of patch items <a href=\"https://brapi.org/news/apr-27-2020\">HERE</a>. </p><h4>New BrAPPs</h4><p>There are two new BrAPPs available to the community! I will be adding both of these projects to the library on brapi.org later this week. </p><ul><li><p>The <a href=\"https://github.com/solgenomics/brapi-fieldmap\">BrAPI Field Map</a> tool allows users to draw and edit plot layouts, overlaid on GoogleMaps images. This allows users to quickly add or update some geo-spatial data for fields and plots without the need to walk the field with a GPS device. </p></li><li><p><a href=\"https://github.com/cropgeeks/flapjack-bytes\">Flapjack Bytes</a> is a JavaScript and HTML5 Canvas based graphical genotype visualization tool. It can be used to do visualizations of small to medium data sets in the browser, or it can be used to preview larger datasets before downloading them into the desktop version of Flapjack. </p></li>"
    },
    "apr-27-2020": {
        "ISO8601": "2020-04-27",
        "title": "Release - BrAPI V2.0 Patch Notes",
        "date": "April 27, 2020",
        "author": "Peter Selby",
        "article": "<p>While implementing the official BrAPI V2.0 Test Server, I found several critical issues with the specification document. Many of these things break general BrAPI rules (for example, every BrAPI object must have 'additionalInfo'), or they don't make logical sense (for example, a 'page' parameter when pagination is not allowed). These changes are meant to clarify the documentation, not to make any meaningful change to any implementation. If you have done any work with BrAPI V2.0, please review the list of patch items below. </p><ul><li>PUT /attributes/{dbid} was marked as a POST incorrectly</li><li>PUT /attributevalues/{dbid} was marked as a POST incorrectly</li><li>GET /search/markerpositions/{dbid} was marked as a POST incorrectly</li><br/><li>GET /programs was missing the 'programDbId' query parameter</li><li>GET /crossingprojects was missing 'externalReferenceId' and 'externalReferenceSource' query parameters</li><li>GET /ontologies was missing 'ontologyDbId' query parameter</li><li>GET /maps was missing 'mapDbId' query parameter</li><li>GET /locations was missing 'locationDbId' query parameter</li><li>GET /crosses was missing 'crossDbId' query parameter</li><li>GET /plannedcrosses was missing 'plannedCrossDbId' query parameter</li><li>GET /events was missing 'eventDbId' query parameter</li><li>GET /observations was missing 'observationDbId' query parameter</li><li>GET /observationUnits was missing 'observationUnitDbId' query parameter</li><li>GET /references/{dbid} was missing Authorization header parameter</li><li>GET /referencesets/{dbid} was missing Authorization header parameter</li><br/><li>GET /crossingprojects/{dbid} had extra, unusable query parameters 'externalReferenceId', 'externalReferenceSource', 'page', and 'pageSize'</li><li>GET /maps/{dbid} had extra, unusable query parameters 'page' and 'pageSize'</li><br/><li>PUT /seasons changed from an array request body to a single object request body</li><li>POST /seedlottransactions changed from a single object request body to an array request body</li><li>PUT /variables/{dbid} was missing request body definition</li><br/><li>CrossingProject object was missing the field 'additionalInfo'</li><li>Scale object was missing the field 'additionalInfo'</li><li>Trait object was missing the field 'additionalInfo'</li><li>ImagesSearchRequest object was missing the field 'imageDbIds' </li><li>Reference object was missing the field 'referenceSetDbId'</li><li>VariantSearchRequest object was missing the field 'variantDbIds' </li><li>ReferenceSetSearchRequest object was missing the fields 'accessions', 'assemblyPUIs', 'md5checksums', and 'referenceSetDbIds'</li><li>ReferenceSearchRequest object was missing the fields 'accessions', 'md5checksums', 'referenceDbIds', 'referenceSetDbIds', 'isDerived', 'minLength' and 'maxLength'</li><li>CallSet object had the field 'variantSetIds', it is now 'variantSetDbIds'</li></ul>"
    },
    "mar-13-2020": {
        "ISO8601": "2020-03-13",
        "title": "Release - BrAPI V2.0",
        "date": "March 13, 2020",
        "author": "Peter Selby",
        "article": "<p>BrAPI V2.0 is officially released!</p> <p>This release is the culmination of all the lessons we as a community have learned from V1 and some critical new features. Over 100 issues from Github were resolved as part of this release, and 102 new endpoints were added to the specification. BrAPI now has a total of 179 possible endpoints to implement.</p> <p>One of the biggest changes in V2.0 is the separation into modules. There are now four BrAPI modules: BrAPI-Core, BrAPI-Phenotyping, BrAPI-Genotyping, and BrAPI-Germplasm. This divide helps organize the specification into more manageable pieces, making it easier to work with.</p> <p>All of the links for all of the documentation for all of the modules can be found here: <a href=\"https://brapi.org/specification\">https://brapi.org/specification</a> <br/>If you are interested in moving from V1.3 to V2.0, the full change log is available here: <a href=\"https://github.com/plantbreeding/API/releases/download/V2.0/BrAPI_V2-0_Release_Notes.xlsx\">https://github.com/plantbreeding/API/releases/download/V2.0/BrAPI_V2-0_Release_Notes.xlsx</a></p> <p>I am currently working on upgrading the BRAVA validation app and the BrAPI Test Server. Please be patient as this upgrade could take some time. I will communicate when all the changes have been made and V2.0 testing services are available.</p> <p>Thank you so much to everyone in the BrAPI community who made this possible! I’m very excited to see where the next few years take us! As always, if you have any questions, comments, or concerns, please reach out to me. I am here to help.</p>"
    },
    "mar-10-2020": {
        "ISO8601": "2020-03-10",
        "title": "Hackathon - March 2020 Hyderabad - Debrief",
        "date": "March 10, 2020",
        "author": "Peter Selby",
        "article": "<h3>Hello from Hyderabad</h3> <p>On February 7, 2020, we concluded the 8th BrAPI Hackathon, hosted by ICRISAT in Hyderabad, India. We had a very fun and productive week, with 20 participants from around the world. A big thank you to Abhishek Rathore for volunteering to host and organize this event, and a big thank you to “Siva” Selvanayagam Sivasubramani and Chaitanya Sarma for keeping us safe, well fed, and entertained while we were visiting. There was a good mix of project work and discussions during the week and I will share a few highlights.</p> <p>We had 7 first time attendees who all took the “BrAPI 101” class on Monday morning. After that, this group was well equipped to find use cases and start working on their own BrAPI implementations. This year there were several new client applications joining the community, looking to connect with data base providers. This includes a citizen scientist data collection tool called Climmob from Bioversity-CIAT, a new genetics database called Plant GARDEN from Kazusa, a set of GS and GWAS analysis tools from ListenField Inc, and some mobile apps and analysis R packages from IITA. I hope to see all of these projects and organizations back in future events.</p> <p>There were two groups, from IITA and ICRISAT, who were both working on database dashboards. The idea behind these dashboards is to get an overall summary of the data contained in the database, and see it update live as data is added and curated. This is useful for external users to see what is available, and internal users to see which datasets have obvious problems or need more details. I hope these two groups can continue to collaborate, and maybe we will see a new BRAPP come from this effort.</p> <p>The Flapjack and BrAPI-R teams continue their long history of involvement at almost every hackathon. This year, the groups from JHI and GOBii continued to work on Flapjack Bytes. This is the new tool which takes the classic Flapjack visualization and embeds it in a web browser. They were also able to test out the BrAPI V2 genotyping module for the first time. There are obviously some data size limitation when using JavaScript in the web browser, but at the end of the week they were able to show off some impressive results. The BrAPI-R package has been re-written and simplified so now most of it can be generated directly from the BrAPI specification. This will make maintenance of the package very easy in the future and free up more time for creating more R analysis packages.</p> <p>In past hackathons, we have had discussions concerning the next versions of BrAPI, but now we have the BrAPI Review Board. So a new to this year four representatives from the review board (Jan Erik Backlund, Iain Milne, Cyril Pommier and myself) were able to spend some dedicated time reviewing the BrAPI V2 specification. This was a good exercise and we found several critical issues that we wanted to correct before formal release. V2 will be released as the final version as soon as I am finished fixing those issues.</p> <p>We had two major discussion topics, “Efficiency vs Flexibility” and “Sustainability and Governance”. During the “Efficiency vs Flexibility” discussion we talked about the tradeoff between efficiency of the API versus the flexibility of the API. It is generally agreed that BrAPI focuses on being more flexible, trying to handle a wide array of different use cases. Unfortunately, this means in most cases thing become less efficient. When dealing with small and medium data sets, this is usually acceptable, but the BrAPI community is still looking for the right solution for handling large data sets. During the discussion, we outlined some existing problematic use cases and brainstormed some ideas around solving these problems. During the “Sustainability and Governance” discussion, we talked about the future of BrAPI as a sustainable project and how to keep it going long term. I was really happy to hear a lot of support and ideas come out of this discussion. It is really exciting to realize that we are building a strong community that wants to see this project succeed in the long term.</p> <p>Finally, I am looking for volunteers to host the next BrAPI Hackathon! Since we all just went to Asia, next we will move to the Americas. Any volunteers in North or South America, please reach out to me if you or your organization has any interest in hosting a hackathon! I’m making a special request for volunteers to all our South American partners because the hackathon has not been there yet (and neither have I). Due to the current state of world health and travel concerns right now, we will likely delay the next hackathon until early 2021 so we have plenty of time to plan and adjust as needed.</p>"
    },
    "dec-18-2019": {
        "ISO8601": "2019-12-18",
        "title": "BrAPI Update - December 2019",
        "date": "December 18, 2019",
        "author": "Peter Selby",
        "article": "<h3>Hello BrAPI Community</h3> <h4>Hackathon Reminder</h4> <p>We are a little over 6 weeks away from the next BrAPI Hackathon hosted by ICRISAT in Hyderabad, India. There are still a few seats left! If you would like to participate please go to brapi.org/events right now and sign up! Right now we have 16 different organizations represented and 10 attendees who are new to BrAPI. </p> <h4>PAG 2020</h4> <p>As usual, for those of you attending the Plant and Animal Genome (PAG) conference in San Diego, BrAPI will be having a community meeting. We have a meeting room reserved Sunday, Jan 12, from 10:30 to 12:30. The primary topic will be BrAPI V2.0, and overview of the changes and a chance to ask questions. If you will be at PAG but can’t make it to the community meeting, send me an email and we can setup a time to talk one on one if you would prefer. </p> <h4>BrAPI V2.0 Release Schedule Update</h4> <p>On Monday, the BrAPI Review Board has voted to delay the official release of BrAPI V2.0 by one month. The official release date will be Feb 1, 2020. This is to provide adequate time to review the new specification and give it a stamp of approval with confidence. This version of the BrAPI spec is intended to be stable and static for at least one year, so I want to be confident there are no major issues before committing to it. Hopefully, this will not disrupt anyone’s work too much. The V2.0 spec is available at brapi.org/specification, and you are free to implement it, just be aware that it is subject to change without warning until February. As always, if you have any questions or concerns, please reach out to me. </p> <h4>EBS DevOps Hackathon</h4> <p>At the end of October, I went down the CIMMYT headquarters in Mexico to participate in the EBS DevOps Hackathon. The primary goal of this hackathon was to connect the different tools which make up the EBS system and stream line the deployment process. While this is effort was not entirely BrAPI related, I was able to assist the CIMMYT, IRRI, DArT, and GOBii teams with a variety of integration strategies. EBS is utilizing a micro-service architecture which requires a service bus or gateway to allow services to communicate with each other and the outside world. This is a slightly complex strategy to implement, but it keeps things organized when you have many different applications trying to work together as a single system. During the hackathon, we were able to get four applications and the service gateway automatically deployed to a clustered environment. Now the development teams can begin building workflows between the applications, using a combination of custom API’s and BrAPI endpoints.</p> <p>At the same time as the hackathon, EiB Module 5 had their annual planning meeting, and I was able to demo the progress on the automated sample submission use case. I have begun development of a demonstration tool which takes a set of sample data and pushes it through the full workflow. After that meeting, there was a tentative plan made to turn what I had started into a BrAPP of some kind, so keep an eye out for that if you are interested in automated sample submission to a genotyping vendor.</p> <h4>Biohackathon Europe 2019</h4> <p>In the middle of November, I went to Melun, France, to attend the Biohackathon Europe 2019. This is a very interesting event, primarily sponsored by ELIXIR, bringing together a large group of biologists, data scientists, and computer scientists to work on a number of different projects. This year there were about 150 participants working on 33 different projects, ranging from plant and human genetics projects to better biology data publishing. It was an excellent networking event, and I spoke to a several different groups while I was there. But I was primarily working with developers from INRA, IPK, EBI and SouthGreen. During the week, we built a small tool to transfer genomic data from a BrAPI resources to EBI’s public Biosamples database. We used Gigwa as the BrAPI compatible data source. While the transfer tool was not production ready by the end of the week, we did enough to demonstrate the proof of concept (and find a few bugs in the new EBI submission web service). I look forward to seeing how this use case grows in the coming year.</p> <h4>University of Tokyo, Breeding Data Symposium and Meetings</h4> <p>Finally, I wish a warm welcome to the latest groups to join the BrAPI Community. At the beginning of December, I joined representatives from INRA, Breedbase, and Breeding Insight on a visit to the University of Tokyo. There we met with Hiro Iwata’s Lab and their collaborators at ListenField and Kazusa. They are building a suite of analysis and genomic selection tools and they are eager to collaborate with data providers. We discussed some potential use cases and how BrAPI could help. They also hosted a symposium for many Japanese government and industry seed company representatives. At the symposium, the other visitors and I gave presentations on the collaborative work we have been doing. I was even able to convince representatives from ListenField and Kazusa to attend the BrAPI Hackathon in Hyderabad. It was a fun and productive trip and I look forward future collaboration. </p>"
    },
    "oct-09-2019": {
        "ISO8601": "2019-10-09",
        "title": "BrAPI Update - October 2019",
        "date": "October 9, 2019",
        "author": "Peter Selby",
        "article": "<h3>Hello BrAPI Community</h3><h4>BrAPI V2 Developer Preview</h4><p>The documentation for BrAPI V2 is available now as a developer preview. This is meant to give the community a chance to interact with and review V2 before it is officially released. This means that the documentation currently posted could change without warning, implement at your own risk. Assuming there are no large critical changes that need to be made, the plan is to officially release V2.0 by the end of the year. So if you have any comments or concerns, please communicate them (create an issue) by December. I am still working through the existing backlog of issues on GitHub. So if there is an existing unresolved issue you feel strongly about, leave a comment on it. This will help me prioritize things. </p><p>Check it out at <a href=\"https://brapi.org/specification\">https://brapi.org/specification</a></p><p>Besides the permanent removal of all previously deprecated things, there have been a number of big structural changes to BrAPI. BrAPI V2 has been split into four modules; Core, Phenotyping, Genotyping, and Germplasm. These modules help to organize the spec, and allows groups to focus on areas of interest. The modules also provide a way of breaking up the specification into smaller units because many new endpoints have been added. As requested, every primary entity now has a POST endpoint for adding new objects, and a PUT endpoint for updating existing objects. Many of the hierarchical endpoints have been reduced to simpler forms to reduce interdependence of concepts. For example, `GET /studies/{studyDbId}/observations` has become `GET /observations?studyDbId={studyDbId}`. This means “studyDbId” is optional and you are not required to have the concept of “studies” in order to store or retrieve “observations”. The Genotyping Module has been totally re-written to follow the GA4GH schema, which was originally based on VCF. I’m sure there will need to be a few iterations of this new GA4GH design before it can accommodate everyone’s needs, but I’m very happy with the direction it is going so far. It is on my TO-DO list to create a complete change log which details all the differences between V1.3 and V2.0, but there are a lot of little differences so it may take some time to compile. </p><h4>BrAPI Hackathon</h4><p>There are still several seats available at the next BrAPI Community Hackathon. We are only 4 months away, so if you intend to register, now is the time. We will be hosted by ICRISAT at their Hyderabad campus, February 3-7. From the already registered attendees, I have a few requests for people from the following groups: the Casavabase team, the Phenoapps team, the Embrapa team, the BMS dev team, and a few specific individuals I will reach out to separately. If you are part of one of these teams, please consider attending as someone has requested your help on a project. If you would like details on who has asked and for what project, please contact me.</p><p>I received word from Maikel Verouden, our host for the last Community Hackathon at WUR. Maikel reports that hosting a hackathon at his local campus was actually less expensive overall than sending representatives to a foreign country (though hosting definitely took more of his time). I am always looking for volunteers within the community to host these events, so please consider this feedback and let me know if your organization might be interested in hosting at some point in the coming years. </p><p>Sign up for the next BrAPI Hackathon at <a href=\"https://brapi.org/events\">https://brapi.org/events</a></p><h4>BrAPI Review Board</h4><p>We have established the official BrAPI Review Board mentioned in previous news posts. The purpose of this board is to represent a cross section of the community, review the specification and come to a consensus on critical decisions. Jan Erik Backlund, Rob Kooper, Matthias Lange, Iain Milne, Lukas Mueller, Tim Parsons, and Cyril Pommier have all volunteered a small amount of their time to be part of this board. We plan to meet quarterly to review changes and discuss critical issues. If you have questions or you would like to get involved, please reach out to me.</p><h4>Joint Deployment Hackathon</h4><p>Here at Cornell, a small group of us got together for a Joint Deployment Hackathon. The primary goal of this was to establish an instance of BreedBase and an instance of GOBii deployed together on a cloud server and sharing data through BrAPI. We were able to set this environment up, with several tools in the BreedBase site that were pulling data from both GOBii and the BreedBase database. This was a very success proof of concept for useful interactions through BrAPI, as well as a successful example of how to configure BrAPI services with a standard deployment procedure. I look forward to where this proof of concept will lead, and I’m excited to take some of the deployment strategies down to CIMMYT for a similar event with EBS at the end of this month. </p>"
    },
    "aug-28-2019": {
        "ISO8601": "2019-08-28",
        "title": "BrAPI Update - August 2019",
        "date": "August 28, 2019",
        "author": "Peter Selby",
        "article": "<h3>Hello BrAPI Community, </h3><h4>JHI Hackathon Recap</h4><p>During the very end of July and beginning of August, a group of us gathered in Dundee, Scotland at the James Hutton Institute. There were representatives from CIMMYT, IRRI, ICRISAT, GOBii, and of course our hosts at JHI. A primary focus of this event was to connect applications to a GOBii database. To this end, I have recently been working with the GOBii team to implement the new GA4GH genotyping schema, which will become an official part of the standard in V2.0. One group was working on extracting data into Flapjack Bytes, the new web app from the Flapjack team. Another team was working on extracting data into Galaxy for analysis. A third group worked on a prototype for a pedigree and consensus calling tool. Excellent progress was made on all three fronts and I look forward to seeing the future of each project. </p><h4>PhenoApps Hackathon Recap</h4><p>Last week, Cornell hosted the annual PhenoApps Hackathon, which is targeted to developing mobile apps for plant breeding. I was joined by representatives from KSU, Makerere University, Breeding Insight, BreedBase, and the Ed Buckler Lab. It was a very productive week and a great learning opportunity as many of the attendees were new to the technologies and applications we were working with. </p><p>I wanted to share a couple of BrAPI related highlights from the week. First, a group was able to connect an automated image analysis tool to a Breedbase web page via API’s. While only half of the process is BrAPI compliant, strictly speaking, it is still an excellent push in the right direction for other types of rapid phenotyping/ image analysis services. I will be maintaining a dialog with this project and perhaps a future version of BrAPI will allow the process to become fully compliant. </p><p>Second, there were several different projects looking to make KSU Fieldbook BrAPI compliant. This venture was a remarkable success. We were able to see a full demo consisting of authenticating a user and acquiring a token, downloading field layout and trait data, and uploading collected phenotype data back to the Breedbase test server. While many of these steps still need some polish, the proof of concept is there and I expect to see many interesting developments in the coming months. </p><h4>BrAPI V2.0 progress</h4><p>Work on BrAPI V2.0 continues to progress smoothly. According to the tentative schedule proposed during the Wageningen hackathon, please expect an alpha/developer release to review by the end of September. I will also be organizing the first meeting of the BrAPI Review Board soon. My personal goal is to resolve a large percentage of the issues currently open so that we can start using version 2.0 with a relatively clean slate. </p><h4>Next Hackathon Reminder</h4><p>Last but not least, a quick reminder to everyone that the next BrAPI community hackathon will be hosted by ICRISAT in Hyderabad, India, from Feb 3-7. We only have 35 seats available at the venue and they are going fast. Please spread the news to anyone who may be interested in working on BrAPI related projects and go to <a href=\"https://brapi.org/events\">brapi.org/events</a> to reserve your seat NOW! </p>"
    },
    "jul-24-2019": {
        "ISO8601": "2019-07-24",
        "title": "BrAPI Update - July 2019",
        "date": "July 24, 2019",
        "author": "Peter Selby",
        "article": "<h3>Hello BrAPI Community,</h3><p>This is the July monthly update. I hope everyone in the Northern hemisphere is enjoying their summer and everyone in the Southern hemisphere is keeping warm. </p><h4>BrAPI Community Hackathon</h4><p>The next BrAPI Community Hackathon is a go! We will be hacking from February 3-7, 2020 at the ICRISAT Headquarters Campus in Hyderabad, India. The conference venue is limited to 35 participants, so sign up today and reserve your seat. Sign up form and travel guide are available at <a href=\"https://brapi.org/events\">brapi.org/events</a>.</p><h4>BrAPI V2</h4><p>BrAPI V2.0 is making good progress. The basic structure of how entities will be divided across the different modules is in place. POST/PUT calls have been added in a consistent pattern for adding and updating data. The BrAPI-Genotyping module has gone through some major revisions with the introduction of the GA4GH schema. A first draft of the JSON-LD context has been generated, though still some work before we are fully JSON-LD compatible. You can follow along with the development progress with any of the links below.<br><a href=\"https://github.com/plantbreeding/API/tree/brapi-v2-dev\">Github</a><br><a href=\"https://app.swaggerhub.com/apis/PlantBreedingAPI/BrAPI-Core/2.0\">BrAPI-Core Swaggerhub</a><br><a href=\"https://app.swaggerhub.com/apis/PlantBreedingAPI/BrAPI-Phenotyping/2.0\">BrAPI-Phenotyping Swaggerhub</a><br><a href=\"https://app.swaggerhub.com/apis/PlantBreedingAPI/BrAPI-Germplasm/2.0\">BrAPI-Germplasm Swaggerhub</a><br><a href=\"https://app.swaggerhub.com/apis/PlantBreedingAPI/BrAPI-Genotyping/2.0\">BrAPI-Genotyping Swaggerhub</a></p><h4>BrAPI Testimonials</h4><p>I am still looking for more BrAPI community success stories. These stories can be anything: any implementation that helped someone access data, anytime shared tools or BrAPPs were used, any process where data flow was automated. Submit your story in the form below. A big thank you to those people who have already sent me their stories. <br><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdEips4UD6X892XRX1olBIuU1b8ey-ZEa00Ym9fgV5_Uh9STg/viewform?usp=sf_link\">Submit a Success Story</a></p>"
    },
    "jun-17-2019": {
        "ISO8601": "2019-06-17",
        "title": "BrAPI Update - June 2019",
        "date": "June 17, 2019",
        "author": "Peter Selby",
        "article": "<h3>Hello BrAPI Community!</h3><p>I will start this monthly update a little differently than the others; with two requests to you, the readers. </p><p><strong>Request #1 Testimonials - </strong> I have recently been asked to better publicize and present the successes of BrAPI outside the community (in particular: to funders). So I wanted to take this opportunity to ask everyone in the community for a success story involving BrAPI. These stories can be anything: any implementation which helped someone access data, anytime shared tools or BrAPPs were used, any process where data flow was automated. The story can be about a proof of concepts or something in production. If you have an idea but you are not sure if it counts as a success story, it probably does, write it down! <br/>I will leave the submission form open for the next few weeks to give everyone plenty of time, but I also know how these things can get lost in day to day work. So I encourage everyone to take 5 minutes RIGHT NOW, click the link below, and write something down. I will happily follow up, edit, and expand on stories as needed, I just need something to start with. </p><p><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://docs.google.com/forms/d/e/1FAIpQLSdEips4UD6X892XRX1olBIuU1b8ey-ZEa00Ym9fgV5_Uh9STg/viewform?usp=sf_link\">Write a Success Story!</a></p><p><strong>Request #2 Review Board - </strong> Over the past 18 months, the BrAPI community has been organized as a <a href=\"https://en.wikipedia.org/wiki/Benevolent_dictator_for_life\">Benevolent Dictatorship</a>, with myself acting as the fearless leader. I believe this was a good model and important to the clean up and stabilization of the project. Now, with the beginning development of BrAPI V2, we are reaching a new era, which requires a new governance model. I would like to establish a BrAPI Review Board. This group of people would be responsible for the following: <ul><li>Be available to discuss and, if necessary, vote on controversial decisions</li><li>Review and approve final versions of the spec before it is released publicly</li><li>Assist in the privatization of issues raised by the community</li></ul> I recognize that being a member of this group is un-paid and completely voluntary, so I will do my best to keep the time commitment to a minimum. If you would like to volunteer your self or nominate someone for this review board, or if you have opinions on how this group should be organized, please contact me. </p><h4>BrAPI V2</h4><p style=\"margin-left: 20px;\">I have broken ground on the development of BrAPI V2. The first big change is the separation of the ever growing specification into smaller parts which can be more easily consumed. So far, I have made the following BrAPI Modules: <ul><li><strong>BrAPI Core</strong> contains high level entities used for organization and management. This includes Programs, Trials, Studies, Locations, People, and Lists</li><li><strong>BrAPI Phenotyping</strong> contains entities related to phenotypic observations. This includes Observation Units, Observations, Observation Variables, Traits, Scales, Methods, and Images</li><li><strong>BrAPI Genotyping</strong> contains entities related to genotyping analysis. This includes Samples, Markers, Variant Sets, Variants, Call Sets, Calls, References, Reads, and Vendor Orders</li><li><strong>BrAPI Germplasm</strong> contains entities related to germplasm management. This includes Germplasm, Germplasm Attributes, Seed Lots, Crosses, Pedigree, and Progeny</li></ul> These modules are currently only present on Github under a development branch, but within the next few days I hope to have the modules posted on a set of Apiary and SwaggerHub demo pages.</p>"
    },
    "may-17-2019": {
        "ISO8601": "2019-05-17",
        "title": "Hackathon - June 2019 Wageningen - Wrap-up",
        "date": "May 17, 2019",
        "author": "Peter Selby",
        "article": "<h3>Greetings from Wageningen,</h3><p> Another hackathon has come and gone, and I continue to be very impressed by this community! On May 3rd we concluded the 7th BrAPI Community Hackathon hosted by Wageningen University and Research, and I would like to extend a big THANK YOU to Maikel Verouden for making this event possible. Maikel spent the week keeping us all happy, caffeinated, fed, and productive by simultaneously being our host, tour guide, and IT department. This hackathon would not have happened without his help. </p><p>As I mentioned in the last monthly update, this was our largest hackathon so far with 40 attendees from 26 different organizations around the world. I will not be able to cover all of the work that everyone accomplished in this debrief, but here are some highlights that I found particularly interesting. </p><h4>BrAPI V2</h4><p style=\"margin-left: 20px;\"> The big highlight from the hackathon was the formal decision to begin development of BrAPI V2. I asked the community if they felt there were any critical issues that require releasing a version 1.4. I have not heard any such feedback, so we will proceed with developing version 2.0. I have made a commitment to release an alpha version by September 2019. This alpha version is for early adopters and for review by the community. We will also begin splitting the BrAPI specification into separate modules, and each module will have its own set of documentation. I hope that this will reduce the growing complexity of the BrAPI standard and allow better organization of the documentation. </p><h4>External Standards</h4><p style=\"margin-left: 20px;\"> There is a big push to map and connect the BrAPI standard to other existing standards. A small group of us created a list of other existing standards that we would like to connect with BrAPI. These range from domain specific data standards like MCPD and MIAPPE to technical standards like JSON-LD and GeoJSON. Some of these standards can be incorporated directly into the BrAPI schema. Others will have documentation that maps the standard to the appropriate elements in BrAPI. The overall goal is to ease the understanding of BrAPI by linking to known standards in the community and discover holes in the BrAPI spec which have been covered by other communities. In addition to the discussions, a group of developers from INRA was focusing specifically on the connection between BrAPI and MIAPPE. This group was able to provide several suggestions and pull requests to enhance BrAPI and align it more closely with the MIAPPE defined data structures. </p><h4>High Throughput Phenotyping</h4><p style=\"margin-left: 20px;\"> We had a good conversation about high throughput phenotyping during the hackathon. The data models within BrAPI are mostly sufficient to represent the needs of HTP, however there is a need to handle different scales of phenotyping data. Many HTP use cases deal with rapid or continuous collection of observations. The plan is to introduce the concept of time-series into the BrAPI schema, and the necessary endpoints to handle that type of data. Other HTP use cases deal with image analysis, and it seems that the image entities in BrAPI are sufficient for handling those images, for now. There may be more enhanced image meta-data needs in the future. </p><h4>Agronomy</h4><p style=\"margin-left: 20px;\"> The discussion around an agronomy API standard continued and some tentative models were created to be implemented in BrAPI V2. These include things like Experimental Factors, Treatments, Events, and Environments. We had some representation from the agronomy community, but these APIs will need to be reviewed and tested by more members of that group. </p><h4>Libraries (R, Tripal, JS) </h4><p style=\"margin-left: 20px;\"> A regular fixture at every BrAPI hackathon is the group working on client libraries. These code libraries make it easy for client application to connect to BrAPI enabled servers. They take the BrAPI style JSON returned from a server and map that data to the data structures more user friendly in their native language. In Wageningen, we had three teams working on client libraries; the BrAPI R package, the BrAPI/Tripal Drupal module, and the BrAPI.js JavaScript library. Each of these has their own unique suite of features, and each has at least begun the upgrades necessary to become V1.3 compliant. </p><h4>Sample Submission</h4><p style=\"margin-left: 20px;\"> The Automated Sample Submission project has made some significant progress during the hackathon. The GOBii and BMS teams spent a lot of time refactoring the existing API calls and connecting those two applications. Several groups started taking advantage of the DArT Vendor services implementation and sending sample data to the DArT test server. This is a big win for BrAPI and clear demonstration of a complex use case based on the community developed standards. I am excited to see where this goes in the future. </p><h4>BrAPPs (Flapjack Bytes, BrAPI-HeatMap, Generic Search Indexer) </h4><p style=\"margin-left: 20px;\"> BrAPPs are self-contained tools that can get their data entirely through BrAPI endpoints. We had three new BrAPP developments: Flapjack Bytes, the BrAPI-HeatMap, and Generic Search Indexer. Flapjack Bytes is a new tool that the JHI group has been working on for visualizing genotyping sequence data. It is a simplified version of the Flapjack visualization tool, built in JavaScript, and can run in a browser. The JHI team worked on some efficiency and bug fixes, and a couple other groups worked on trying to add Flapjack Bytes into their own applications. The BrAPI-HeatMap tool is another BrAPP creation from the Mueller Lab. It takes observation, trait, and layout data from a BrAPI endpoint and creates a heat map visualization of that data. This visualization can also be overlaid on a real Google Maps image. The Generic Search Indexer is a tool for building a search index from all the data accessible through BrAPI. Indexes can be built for a single endpoint or by a federated collection of endpoints. Once and index is created, free text searches can be performed on the indexed meta-data and linked back to the original data source for retrieval. Both the ELIXIR group and the Cold Spring Harbor Laboratory were looking at different technologies to achieve the same outcome, and there was some discussion on collaboration between the two groups. </p><h4>Endpoint Implementations</h4><p style=\"margin-left: 20px;\"> One of the main goals of the BrAPI community hackathon is to provide a time for developers to work on their own implementations of the BrAPI specification, with the support of the community. Many of the groups present at this hackathon worked on their own systems endpoints. Each team has their own objectives and priorities, some have a specific use case or workflow they are trying to implement, others simply want to map their data to the standard and expose it to the community. I hope this implementation work will continue outside the hackathon, and I am excited to see what everyone has accomplished by the next hackathon. </p>"
    },
    "may-16-2019": {
        "ISO8601": "2019-05-16",
        "title": "Community Announcment - BrAPI Paper Accepted",
        "date": "May 16, 2019",
        "author": "Peter Selby",
        "article": "<h3>Hi All, </h3><p>Just a quick note to let everyone know that the BrAPI paper is officially out (and corrected) on Bioinformatics! This has been a long, difficult road and I would like to thank everyone who has contributed to the effort.<p><p><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://academic.oup.com/bioinformatics/advance-article/doi/10.1093/bioinformatics/btz190/5418796 \">BrAPI Paper</a></p><p>Share, cite, and enjoy! <br/> Pete </p> "
    },
    "apr-19-2019": {
        "ISO8601": "2019-04-19",
        "title": "BrAPI Update - April 2019",
        "date": "April 19, 2019",
        "author": "Peter Selby",
        "article": "<h3>Hello BrAPI Community!</h3><p>Its about time for another BrAPI Community update! </p><h3>Wageningen Hackathon</h3><p>The next BrAPI hackathon is very quickly approaching at the end of this month. We have a full house with 40 attendees coming to the Netherlands for a week of hacking. This event is already promising in a few ways. First, the seats filled up faster than any other BrAPI hackathon I've been a part of. Six weeks after I posted the link to register, we were completely full and starting a waiting list. Second, we are welcoming 13 first time attendees, some from known BrAPI partners, and some from 7 new organizations interested in BrAPI. This is a clear indicator that the BrAPI community is growing, more people and institutions are becoming interested in what we are doing. I hope all our first time attendees find the value they are looking for during the hackathon, and that they find support in this community moving forward.</p><p>For those who are not able to attend this hackathon, I encourage you to take a look at the <a href=\"https://brapi.org/assets/docs/Wageningen_Hackathon_2019_Agenda_4.pdf\">agenda</a> posted on <a href=\"https://brapi.org/events\">brapi.org</a>. It has all the major community discussion topics and a list of the major projects which are planned to be worked on during the event. If there are any topics you feel strongly about, I welcome any comments, questions, and opinions, and I will do my best to represent your views during the discussion. By request, we can set up calls and remote working sessions for smaller discussions and project work, but unfortunately we can not support remote attendees for the large community discussions. As always, look for the hackathon debrief to be posted shortly after it finishes.</p><h3>BrAPI Version 2 Plan</h3><p>During 2018, we spent a lot of time repaying some technical debt within the BrAPI spec by fixing errors and inefficiencies, establishing and following a set of best practices, and formalizing the documentation. These are all very important tasks and have brought us to the standard as we know it today. Now, we have now reached a point where it is time to switch from bug fixing to enhancements to the specification. The majority of issues on GitHub are concerned with adding new features to BrAPI, and so it is finally time to call BrAPI V1 feature complete and begin working on the new features for BrAPI V2. The release schedule for V2 will be slower, allowing for more stability and there will be more opportunity for review each release by the community. We will be discussing the details of BrAPI V2 during the hackathon, and again I encourage anyone who is not attending to send me your thoughts on the subject. </p><br/> <p>That is all the BrAPI news for today! If you have anything you'd like to share with the community in the next BrAPI update, let me know.</p>"
    },
    "jan-08-2019": {
        "ISO8601": "2019-01-08",
        "title": "BrAPI Update - January 2019",
        "date": "January 8, 2019",
        "author": "Peter Selby",
        "article": "<h3>Happy New Year BrAPI Community</h3><h4>Wageningen Hackathon</h4><p>The sign up sheet for the next BrAPI hackathon is now available on <a href=\"https://brapi.org/events\">brapi.org</a>! It will take place at Wageningen University & Research, April 29th through May 3rd. Join the BrAPI community for a week of fun as we hack code together and discuss the future of BrAPI. The travel guide and tentative agenda are also available on <a href=\"https://brapi.org/events\">brapi.org</a>. Our hosts were able fix a group discount at a hotel nearby, so please check the travel guide for details on how to take advantage of that.</p><p><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://brapi.org/events\">SIGN UP HERE</a></p><p><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://brapi.org/assets/docs/Wageningen_Hackathon_Travel_Guide.pdf\">Travel Guide</a></p><h4>PAG BrAPI Meeting</h4><p>For those who are at PAG next week, a quick reminder that we will be having a BrAPI community meeting on Sunday (details on <a href=\"https://brapi.org/events\">brapi.org</a>). Genotyping APIs is the planned focus of the discussion, however if anyone has other topics they would like to discuss with the community, please feel free to bring additional talking points.</p>"
    },
    "dec-05-2018": {
        "ISO8601": "2018-12-05",
        "title": "BrAPI Update - December 2018",
        "date": "December 5, 2018",
        "author": "Peter Selby",
        "article": "<h3>Hello BrAPI Community,</h3> <h4>PAG</h4> <p>I have reserved a meeting room for a BrAPI community discussion at PAG again this year. The title of this discussion is \"Genotyping Data Structures\" and we will focus the discussion around redesigning the Marker, MarkerProfile, AlleleMatrix, and Sample objects currently used in the BrAPI specification. I am trying to produce a small survey which will be sent out ahead of time to further focus the discussion and try to produce some meaningful results. </p> <p>We will gather in the Crescent room (right behind Charlie's) on Sunday from 13:00 - 14:30. Details are also posted on brapi.org. I hope to see you all there!</p> <h4>BRAVA and Test-Server</h4> <p>The BrAPI Validator (BRAVA) and the BrAPI Test Server have both been successfully upgraded to support V1.3. Both tools are hosted publicly (links on brapi.org) or they can be downloaded from GitHub and are ready to run locally. If you have any questions about usage, contact me.</p> <h4>V1.3 Hot Fix</h4> <p>A few days ago, it was brought the my attention that the word \"Refernce\" was scattered throughout BrAPI V1.3, and it is missing an \"e\". I have made a quick patch to the BrAPI V1.3 release and fixed the silly misspelling in all the relevant documentation (GitHub, SwaggerHub, Apiary, etc). If you have been working with BrAPI V1.3, please double check that you have spelled the word \"Reference\" correctly in all the appropriate places. I will be working on adding Spell Check to the new version release process so that I can catch silly mistakes like this in the future.</p> "
    },
    "sep-27-2018": {
        "ISO8601": "2018-09-27",
        "title": "Hackathon - September 2018 Texcoco - Wrap-up",
        "date": "September 27, 2018",
        "author": "Peter Selby",
        "article": "<h3>Hola from Texcoco,</h3>  <p>September 14 concluded another successful BrAPI Hackathon. A big THANK YOU to Sandra Montanez and everyone at CIMMYT who made this event possible. Sandra did a fantastic job making sure we were well fed, well rested, and had everything we needed. During the months of planning before the hackathon, she made my life immeasurably easier, by helping to organize travel for everyone and navigate VISA requirements. </p>  <p>Here are a few highlights from the hackathon, though it is tough to convey several days of discussion in a couple of sentences. Please reach out to me with any questions you have with any of these topics.</p>  <h4>BrAPI 101</h4>  <p style=\"margin-left: 20px;\">We held a “BrAPI 101” class for newcomers to the community. Eight BrAPI newbies joined me on Monday morning for a few hours to learn what BrAPI is and how to use it. We discussed the basics of RESTful APIs, how to construct BrAPI calls, and the different tools and resources available to members of the BrAPI Community. Then everyone took a little time to implement a simple BrAPI client in their favorite programming language. By Monday afternoon, we had eight new BrAPI experts in the community. </p>  <h4>Phenotypic Data Model</h4>  <p style=\"margin-left: 20px;\">I originally added “Phenotypic Data Model” as an optional discussion topic and I had no specific plan for what we were going to discuss. However, the community quickly spoke up, and we had a very productive discussion about improving the data models for Studies, Observation Units, and Observations. The biggest revelation from the discussion was recognizing the need to nest Observation Units within each other.  For example, an Observation Unit that represents a plant should be able to reference an Observation Unit that represents the plot that contains the plant. </p>  <h4>Analysis Data</h4>  <p style=\"margin-left: 20px;\">There has been some interest in the handling Analysis Data. This data is created after performing some computational analysis on raw, field collected, data. During the hackathon, we quickly realized that we have to be very careful about how detailed we need to be in BrAPI. The group was stuck a few times debating how much information about the analysis methods needs to be communicated. Is the primary use case simply to store results, or is there a need to communicate enough information for analysis replication? We did not come to any satisfying conclusion, but it was a good discussion and got everyone thinking.</p>  <h4>Genotypic Data Model</h4>  <p style=\"margin-left: 20px;\">We had a very productive discussion focused on the Genomic Maps, Markers, Marker Profiles, and Allele Matrices calls. We started with some clarifications around what data lives in a Marker object versus a Map object and how the two are related. Then, we approached the ugly thorn of the group: Marker Profiles. Lukas gave us a recap on the definition of a Marker Profile, and then we got into a slightly heated discussion on changing the name “Marker Profile” and changing the returned object structure. No decisions have been made yet, and I am planning to organize some follow up discussions soon.</p>  <h4>Sample Submission Project</h4>  <p style=\"margin-left: 20px;\">There was a large group working on the Sample Submission Project. This is an EiB effort to allow submission of sample data to a genotyping vendor, then storing the resulting data into a genotypic database, through automated APIs instead of emailing excel spreadsheets. During the hackathon, some significant development progress was made. The BMS developers worked with the GOBii developers to start sending sample data to the GOBii database, and the CIMMYT Sample Tracking developers worked with the DArT and Cornell GBS developers to start submitting samples for genotyping. I am very happy with the progress and I look forward to working with all these groups in the coming months.</p>  <h4>Libraries</h4>  <p style=\"margin-left: 20px;\">Both the BrAPI R library and the BrAPI.js library had significant work put into them during this hackathon. They are both updated to fully support BrAPI v1.2, and work was begun towards automating some of the update process based on the Swagger definition files. This should decrease the maintenance time in the future.</p>  <h4>HTML Flapjack BrAPP</h4>  <p style=\"margin-left: 20px;\">The JHI developers successfully hacked together a first version of an HTML based Flapjack BrAPP. This is a simplified version of the desktop Flapjack visualization tool that can be hosted by any (BrAPI compliant) web server. HTML Flapjack is not meant to replace its desktop counterpart, but rather supplement it, by allowing users to see a preview of their data, before downloading a full Flapjack project to run analysis on. </p>  "
    },
    "jul-25-2018": {
        "ISO8601": "2018-07-25",
        "title": "BrAPI Update - July 2018",
        "date": "July 25, 2018",
        "author": "Peter Selby",
        "article": "<h3>V1.3 Release Date </h3>  <p>Announcement: The BrAPI v1.3 release date has been moved to October 26. This represents a shift from a 3-month release cycle to a 6-month release cycle. After versions 1.1 and 1.2, it was clear that the 3-month cycle was too quick for many in the community. I hope everyone is comfortable with this shift, please let me know if you have any concerns. </p>  <h3>App Development </h3>  <p>We recently wrapped up the PhenoApps Hackathon here at Cornell, organized by the KSU FieldBook team. There was a lot of great work on mobile app projects, and some significant focus on applying BrAPI for mobile app data communication. We took steps toward using existing BrAPI calls to push data back and forth between FieldBook and a centralized database. There was some work into developing a set of BrAPI calls around image storage and retrieval, and some work developing a BrAPI Android library, based on the Swagger Code Gen tool. It was a very productive event and a good way to test out a few more concrete BrAPI use cases. If you are interested in the outcomes of any of these projects, let me know and I can put you in touch with the team who worked on them. </p>  <h3>Sample Submission Project </h3>  <p>In the beginning of July, I began working on a substantial system integration project within the Excellence in Breeding platform. The goal is to automate the submission of sample data to an external processing vendor and collect the resulting lab output to a data repository. I will be working with a group of developers from several different teams over the coming month to implement this automated process. This will be one of the first official integration projects within the EiB and BrAPI is playing a central role. I will soon post documentation related to this use case on the BrAPI Wiki so that other groups in the BrAPI community may follow a similar pattern of calls. </p>  <h3>Texcoco Hackathon </h3>  <p>As we get closer to September, I have been looking at the popular projects and discussion topics, based on the short survey on the hackathon sign up form. Right now, the top 3 discussion topics will be around improving the phenotypic data model, web service authentication, and adding calls for handling generic analysis data. There is also significant interest in a \"BrAPI for Beginners\" class which I will run on the first day to welcome all of the people who are new to the community. For project work, I anticipate a big push for mobile phenotype data collection and the sample submission projects I've already mentioned, plus a continued interest in BrAPPs. </p>  <p>OBLIGATORY REMINDER: Sign up <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdXFyoyT3VLovNJ9x9OGMjEm95KhjLTyBIQmGWYlBrRv0Eg1Q/viewform\">HERE</a> for the next BrAPI Hackathon!</p>  <h3>The BrAPI Paper </h3>  <p>Lukas, Jan Erik and I have begun the submission process for the BrAPI Paper. I will announce when it has been accepted and published. Thank You so much to everyone who has contributed! This truly was a community effort!</p>"
    },
    "may-25-2018": {
        "ISO8601": "2018-05-25",
        "title": "BrAPI Update - May 2018",
        "date": "May 25, 2018",
        "author": "Peter Selby",
        "article": "<h3>Texcoco Hackathon</h3>  <p>The Sign Up form for the next BrAPI Hackathon is now OPEN. Click <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdXFyoyT3VLovNJ9x9OGMjEm95KhjLTyBIQmGWYlBrRv0Eg1Q/viewform\">HERE</a> or go to the <a href=\"/events\">Events page</a> on brapi.org to reserve your seat today!!</p>  <p><p>I encourage everyone to fill out the form and reserve a spot, even if you are not sure you can attend. I know that traveling in the second half of the year can be challenging as budgets get tighter, but I'm hopeful that the organizations you represent see the added value of spending a week learning from and working with your peers from around the world. </p>  <p>The Sign Up form also includes a small survey about what BrAPI related discussions and projects would be most useful to you. We will be building an agenda based on your feedback, so please give it some thought. What aspects of BrAPI need to be discussed by the community? Which other teams would you like to integrate with? What BrAPI related projects has your team been neglecting? </p>  <br/>  <h3>The BrAPI Paper</h3>  <p>Thank you to everyone who took the time to add comments and contributions to the BrAPI Paper. We received so many excellent edits and responses that we have decided to do a second round of community feedback! Lukas, Jan Erik, and I are working hard to incorporate everyone's feedback into the draft document, once we are complete, we will open the google doc for comments again. If you missed the first round, or you weren't able to review the whole document, now is your chance to have your voice heard. I will send out a separate announcement when we are ready.</p>  <br/>  <h3>Swagger</h3>  <p>I'm pleased to announce that BrAPI is now defined using the OpenAPI standard, better known as Swagger. All the old Markdown files have been replaced by YAML files in the master GitHub branch and these YAML files will be the source of all BrAPI documentation starting in V1.3. In an effort to make this transition as smooth as possible, I have included a README file with each group of calls which documents each call in the old Blueprint format. These README's are generated from the source YAML files, so they will not need to be manually maintained. Also, for those of you who have gotten used to Apiary, the Apiary site supports displaying the OpenAPI format. The display looks a little different, but I'm working on making it as user friendly as Apiary will allow. And finally, for those of you who are fans and supporters of Swagger, BrAPI is now officially on SwaggerHub and is ready for all the fancy tools available in the Swagger ecosystem. I'd like to thank Ricardo Ramírez-Gonzalez and Arlo Hoogeveen for their help in this Swagger transformation during the Versailles hackathon.</p>  <p>If you have any questions about Swagger or how to use this new incarnation of BrAPI, feel free to reach out to me.</p>"
    },
    "apr-20-2018": {
        "ISO8601": "2018-04-20",
        "title": "BrAPI Update - April 2018",
        "date": "April 20, 2018",
        "author": "Peter Selby",
        "article": "<p>I'm happy to formally announce that the next BrAPI Hackathon will be in Texcoco, Mexico, September 10-14, 2018! Keep watch on <a href=\"https://brapi.org/events\">Brapi.org</a> for more details, or check the <a href=\"https://forum.brapi.org/t/brapi-hacakthon-texcoco-fall-2018/51/2\">Community Forum</a> and share your excitement. A signup form will be coming soon! </p><p>I'm really excited about the upcoming hackathon. We are prepared for a larger turnout this time, so hopefully we won't have to turn anyone away. Still, the earlier you can sign up, the better, because seats tend to go fast. We received a lot of feedback from Versailles that some kind of introduction to BrAPI for new-comers would be helpful. In response, I have already set aside two and a half hours on day one for this purpose. If you know any individuals or groups who would benefit from BrAPI, encourage them to sign up for this hackathon.</p><p>In other news, BrAPI V1.2 is scheduled to be released next week (April 27th). This release will contain 24 issue fixes, from old clean up items, to newer things discussed in Versailles. This release has been the topic of lots of discussion in the past 6 months, not because of its contents, but because of its timing. This is the test of a 3 month release cycle, and I will be eager to here feedback from the community around this. If no one in the community has the time or resources to implement V1.2, then I will happily drop the 3 month release cycle in favor of a 6 month release cycle. Let me know your thoughts around this, either by email or the <a href=\"https://forum.brapi.org/\">Community Forum.</a></p><p>In parallel with the work on V1.2, a lot of work has been put into a BrAPI Swagger definition. The intent is to change the specification from the \"Blueprint\" markdown format to the \"OpenAPI\" YAML format (aka \"Swagger\"). The OpenAPI format has a strict structure and is a little harder for humans to read, but it will enable lots of cool automated tasks. This includes documentation presentation in a number of different platforms and automatic code generation in 20+ coding languages. Look for that update on GItHub in the next few weeks.</p><p>Finally, we are working on an official BrAPI Publication. Jan Erik, Lukas and I have been working on a draft of this paper and it is almost ready for community input. BrAPI is a community project and we must have the contribution of that community in this publication, so please don't be shy! Even if you have no explicit text to add, leave a comment letting us know that you read it and approve. I'll be sending out details on how to access the draft in the next few weeks.</p>"
    },
    "mar-20-2018": {
        "ISO8601": "2018-03-20",
        "title": "BrAPI Update - March 2018",
        "date": "March 20, 2018",
        "author": "Peter Selby",
        "article": "<p>We have a Wiki! I've added a MediaWiki module to brapi.org. This is the original Wiki service, the same technology Wikipedia is built on. My hope is that it can replace the Documentation Github repository as the source for all BrAPI related documentation. All the old documents from Github have already been transferred to the new site, and a few new things have already been added.  As much as I love writing documentation, wiki's work best as a community effort, so please don't be shy about editing or adding content. Everyone should be able to sign in using their Github accounts, so please feel free to contribute.</p><p style=\"margin-left: 20px;\"><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://wiki.brapi.org\">BrAPI Wiki</a></p><p>Along with a new Wiki, I have received several requests for a general discussion forum. In response, I am working on adding a Discourse forum to brapi.org. This will be a place for the community to hold discussions, support each others development efforts, and plan upcoming hackathons together (without needing a million emails). Look for this to go live in the next few weeks at <a href=\"https://forum.brapi.org\">https://forum.brapi.org</a><p>In other news, the EiB Annual Planning meeting concluded a couple weeks ago in Nairobi, Kenya. There were many productive discussions across all 5 EiB modules. The Module #5 group had good representation of many of the major technologies used by the CGIAR, including BrAPI. We focused on what an ideal IT architecture for a breeding program should look like so we could determine what tools and services are missing, and where the important integration points are between tools. The development teams present agreed on 2 critical BrAPI related integration use cases for 2018: Phenotype field data collection, and Genotype sample data collection.</p><p>Also, at the EiB meeting, we were able to discuss scheduling of upcoming events in 2018, which includes the next BrAPI Hackathon. Based on that discussion, we are targeting September for the next hackathon, though exact dates and venue are still undecided. I will let everyone know as soon as I know more.</p>"
    },
    "feb-14-2018": {
        "ISO8601": "2018-02-14",
        "title": "Hackathon - February 2018 Versailles - Wrap-up",
        "date": "February 14, 2018",
        "author": "Peter Selby",
        "article": "<h3>Greetings from Versailles,</h3><p>Last Friday concluded another successful BrAPI Hackathon. I wanted to take a moment to record some of the highlights of the event and open the discussion to those who were not able to attend. </p><p>First, a very very big “THANK YOU” to Cyril Pommier and everyone at INRA who helped make this event possible. Organizing an event like this takes months of planning and coordination. Cyril was instrumental in getting the venue setup and ready for as many people as we could hold. And then, for those not following the weather reports in Versailles, we were welcomed by a surprise snow storm on Tuesday, which made transportation difficult for everyone. The INRA staff valiantly fought through the snow and we were still able to eat and access our equipment. </p><h3 style=\"margin-top: 50px;\">Discussions Highlights</h3><p>Here are a few discussion highlights and big plans made during the hackathon. Nothing here is set in stone, and it is tough to convey several hours of discussion in a couple of sentences. Please reach out to me with any questions or concerns you have with any of these topics.</p><h4>JSON-LD/PUIDs</h4><p style=\"margin-left: 20px;\">There is a new tentative plan around JSON-LD and entity Permanent Unique IDs. It was established that there are 2 problems which need solving. First, is the problem of “sameness”: being able to determine if two entities from two different systems refer to the same thing. Second, is the problem of “origin” or “authority”: what created a particular entity and who has the authority to enforce the data is correct for that entity. <br/> The solution plan has 3 phases, which will be included in future BrAPI versions. First, add a PUID field to each BrAPI entity to check for “sameness”. Second, an “origin” object will be added to each BrAPI entity with enough information to lead a user back to the origin of that object. These two new fields should be enough to solve the problems stated, but from here it is a short leap to implement JSON-LD. So the final phase is some implementation of JSON-LD, which will allow for a whole host of new functionality. </p><h4>Authentication</h4><p style=\"margin-left: 20px;\">Authentication is a feared subject for many in the BrAPI community and it is a complex problem which will hang around for a long time. During the discussion at the hackathon, we started with the basics of how OAuth2 works, the different options available and then moved into how do we create a general solution in the context of BrAPI. It was generally agreed that it is not within the API’s power to enforce any sort of authentication scheme, but the best we could do was establish a clear set of Best Practices. That list is under development and should be available with BrAPI V1.2.</p><h4>New Calls</h4><p style=\"margin-left: 20px;\">There were several discussions around new BrAPI calls which were needed for a variety of use cases. These included User Created Lists, Seed/Planting Material Tracking, and Germplasm Advanced Search. Each of these discussion outlined a new set of objects and issues were created in the BrAPI GitHub to track their addition to the spec. </p><h3 style=\"margin-top: 50px;\">Project Highlights </h3><p>There was a lot of work accomplished during this hackathon and too many projects to list everything here. Below is an overview of the projects which have the greatest impact on the whole BrAPI community.</p><h4>BrAPI R</h4><p style=\"margin-left: 20px;\">A small team worked on cleaning up the BrAPI R library and moved it all to a new home under the CIP Github organization. Links to the new repository have been update on brapi.org. The team also started two new R packages: BrAPI X and BrAPI UI. BrAPI X provides eXtra tools for convenient bulk download breeding data and also do quick summaries and quality checks. BrAPI UI integrates with RStudio to provide interactive visualization tools which work with the BrAPI R library. </p><p style=\"margin-left: 20px;\"><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://github.com/CIP-RIU/brapi\">BrAPI R</a><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://github.com/c5sire/brapix\">BrAPI X</a><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://github.com/c5sire/brapiui\">BrAPI UI</a></p><h4>BrAPI.js</h4><p style=\"margin-left: 20px;\">BrAPI.js is a JavaScript client library for BrAPI. It provides a simple, fluid interface for making BrAPI calls and functionality for chaining groups of calls together and returning a larger complete dataset. Though some of the more complex data manipulation tools are still in development, the core BrAPI interface is ready and can shorten the development time for anyone implementing a BrAPI client in JavaScript. </p><p style=\"margin-left: 20px;\"><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://github.com/solgenomics/BrAPI.js\">BrAPI.js</a></p><h4>Testing Resources</h4><p style=\"margin-left: 20px;\">BrAVA (the BrAPI Validator App) has been updated. It now runs a full suite of validation tests against any BrAPI compliant server, checking for the correct JSON schema. It also runs these tests regularly against any server endpoint located in the brapi-resources.xml. This provides a nice checkup for all the existing public BrAPI servers. Now is a great time for everyone to make sure their published server endpoints and ‘calls’ call are up to date.<br/>The BrAPI official test server is now live. This is a Java Spring server backed by a generic Postgres database based only on BrAPI objects.</p><p style=\"margin-left: 20px;\"><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"http://webapps.ipk-gatersleben.de/brapivalidator/\">BrAVA</a><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://test-server.brapi.org/brapi/v1/\">Test Server</a></p><h4>BrAPP implementations</h4><p style=\"margin-left: 20px;\">Several teams used the Hackathon as an opportunity to add some BrAPPs to their existing applications. This is very exciting and very cool to see this type of tool sharing across the community. There was also a lot of great feedback going back to the BrAPP creators for bug fixes and possible enhancements. Watch for more BrAPPs coming this year.</p><p style=\"margin-left: 20px;\"><a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://test.brapi.org/brapps\">BrAPPs</a></p><h4>Integration Implementations</h4><p style=\"margin-left: 20px;\">A substantial amount of time was dedicated to implementing some prototypes for broad system integration. The primary focus was on a pedigree verification use case established in December. The group was able to connect data in GOBii to data in BMS or B4R and produce an object which Flapjack was able to read and turn into a visualization. There is still a lot of work need before something like this is production ready, but this was a great first step to realizing this kind of cross system integration with BrAPI.</p>"
    },
    "jan-26-2018": {
        "ISO8601": "2018-01-26",
        "title": "Release - BrAPI V1.1",
        "date": "January 26, 2018",
        "author": "Peter Selby",
        "article": "<p>BrAPI v1.1 is officially here!</p> <p>Release Highlights</p> <ul> <li>15 issues resolved</li> <li>All IDs are standardized with the form \"xxDbId\"</li> <li>ISO 8601 Date/Time format standardized</li> <li>Studies can now be searched by TrialDbId</li> <li>New calls added for samples and sample tracking to an external vendor</li> </ul> <p>Go <a href=\"https://github.com/plantbreeding/API/files/1668289/BrAPI_V1-1_Release_Notes.xlsx\">HERE</a> for the full change list.</p> <p>The raw markdown can be found on GitHub under the <a href=\"https://github.com/plantbreeding/API/tree/V1.1\">\"V1.1\" tag</a> </p> <p>The human readable formatted API definition can be found on <a href=\"https://brapi.docs.apiary.io/#reference\">Apiary</a> </p> <p>Check  the versions table on the <a href=\"https://github.com/plantbreeding/API/blob/master/README.md\">GitHub README</a> for links to all versions of BrAPI, past, present and future.</p>"
    },
    "jan-12-2018": {
        "ISO8601": "2018-01-12",
        "title": "Community Announcement - Introducing BrAPPs",
        "date": "January 12, 2018",
        "author": "Peter Selby",
        "article": "<p>We are happy to officially introduce BrAPPs to the BrAPI ecosystem. <br/> Go to <a href=\"https://brapi.org/brapps\">brapi.org/brapps</a> to check out the BrAPP Showcase, and keep checking back because we will be adding more BrAPPs as they become available. </p> <p> What is a BrAPP? <br/> A BrAPP is a BrAPI Application. <br/>  Each BrAPP is a stand alone tool, widget, or plugin built by a member of the BrAPI community. Each BrAPP, as the name implies, should be entirely BrAPI driven. This means a BrAPP can easily be shared with the whole BrAPI community and can be easily added to any system which has a BrAPI implementation.  </p> <p> The goal is to keep the BrAPI community informed about what tools are available and encourage sharing of useful functionality. </p> <p> If you have a tool or widget you feel can become a BrAPP, please reach out to a <a href=\"mailto:brapicoordinatorselby@gmail.com\">BrAPI Coordinator</a>. At a minimum you'll need a public link to the source code, a name and a description. You should also think about a documentation link and a demo page of some kind, so people can see your BrAPP in action.</p>"
    },
    "jan-02-2018": {
        "ISO8601": "2018-01-02",
        "title": "Community Announcement - BrAPI at PAG",
        "date": "January 2, 2018",
        "author": "Peter Selby",
        "article": "<p>BrAPI is going to PAG!</p> <p>Ascot Hall in the Town and Country Convention Center</p> <p>12:00 to 14:00 on Sunday, January 14</p> <p>This will be an informal BrAPI community meetup during the Plant and Animal Genome (PAG) convention. Come meet, socialize, and network with other members in the BrAPI community.</p> <p>I will be using the time to collect feedback from the BrAPI community. What projects should we focus on for the February hackathon and beyond? How do we make BrAPI useful and used by everyone? What does a perfect BrAPI future look like?</p> <p>Can't make it on Sunday? Don't worry, BrAPI representatives will be wandering around the convention center all week. Reach out to me to arrange a meet up.</p> <p>See you all there</p> <p>Peter</p>"
    },
    "nov-30-2017": {
        "ISO8601": "2017-11-30",
        "title": "Hackathon - February 2018 Versailles - Announcement",
        "date": "November 30, 2017",
        "author": "Peter Selby",
        "article": "<p>We only have a few seats left for the Versailles BrAPI Hackathon! </p> <p>Don't miss your chance to join us for a week of hacking, discussions and fun! </p> <p> Come enjoy beautiful Versailles, France on February 5th through 9th! </p> <p> <a class=\"btn btn-d btn-round\" style=\"margin-left:10px\" href=\"https://docs.google.com/forms/d/e/1FAIpQLScMT2PIr3PO0_oDf8akYWO9DRfIi8GbSaovNAIHtaNuw7A8RA/viewform?c=0&w=1\">Sign Up Here!</a> </p> <p>Already signed up? Watch for more details coming soon on <a href=\"https://brapi.org/events\">brapi.org</a> </p> <p>Hope to see you there!!</p>"
    },
    "nov-21-2017": {
        "ISO8601": "2017-11-21",
        "title": "Community Announcement - Brapi.org Updates",
        "date": "November 21, 2017",
        "author": "Peter Selby",
        "article": "<p>Brapi.org has been updated!</p> <p>The original site was developed in an afternoon during the 2017 Seattle hackathon. It was an excellent start, and gave the BrAPI community a public face and brand. But it was not very developer friendly. As a single page site, every addition quickly created a monolithic structure. It was becoming a hassle to update and was starting to become difficult for users to find relevant information.</p> <h4>Whats new?</h4> <p>The majority of the changes can be seen in the server side file structure. Feel free to take a look at the <a href=\"https://github.com/plantbreeding/brapi-website\">BrAPI site GitHub</a> for more details. Generally speaking, the single giant html file has changed into a handful of smaller PHP files, which are much easier to develop and manage. Also,the whole project has been Dockerized, which makes server management and deployments of future updates much easier.</p> <p>From a user perspective, there has been some reorganization to promote usability. The single home page has been broken into a small set of logical pages. The \"About\" and \"Use Cases\" sections have been lumped together and are still on the home page. The \"Links\" section has become \"Developer Resources\" and now lives on its own page. The \"Partners\" and \"Acknowledgements\" sections have been lumped together and now have their own page as well. And finally,two new pages have been added: \"News\" and \"Events\". \"News\" is intended to be a general purpose, public place to post about BrAPI, the community, and related content (for example, this post you are reading). \"Events\" is for BrAPI related event notices, primarily Hackathons right now, but could grow in the future.</p> <p>Brapi.org is a great place for outside groups to discover and learn about the BrAPI community. If you see any issues with the site, please raise it on GitHub or <a href=\"mailto:brapicoordinatorselby@gmail.com\">reach out to one of the BrAPI Coordinators</a> </p>"
    }
}